{
  "Navbar": {
    "apply": "Apply Now",
    "book-tour": "Book a Tour",
    "school-map": "School Map",
    "contact-us": "Contact Us",
    "news": "News",
    "school-calendar": "School Calendar",
    "work-risr": "Work at RISR",
    "portals": "Portals"
  },
  "Footer": {
    "school-name": "Ruamrudee International school<br></br>Ratchapruek campus",
    "tel": "+66 (0)2 030 0533",
    "address": "Bang Kruai - Sai Noi Rd, Tambon Bang Krang,<br></br> Amphoe Mueang Nonthaburi, Chang Wat<br></br> Nonthaburi 11000",
    "admissions": "admissions",
    "tuition": "Tuition & Fees",
    "apply": "How to Apply",
    "book": "Book a Tour",
    "scholarships": "Scholarships",
    "about": "About RISR",
    "overview": "Overview",
    "history": "History",
    "vision": "Vision & Mission",
    "curriculum": "Curriculum",
    "facilities": "Facilities",
    "leadership": "Leadership Team",
    "academics": "academics",
    "pre-kindergarten": "Pre-Kindergarten",
    "elementary-school": "Elementary School",
    "middle-school": "Middle School",
    "hight-school": "Hight School",
    "community": "community",
    "ris-minburi": "RIS Minburi Campus",
    "ris-early": "RIS Early Years Campus",
    "ris-phuket": "RIS Phuket Campus",
    "work": "Work at RISR",
    "personal-data-policy": "Personal Data Policy",
    "copyright": " 2024 Ruamrudee International School Ratchapruek campus"
  },
  "School-map": {
    "facilities": "FACILITIES",
    "facilities-details": "RIS Ratchapruek is located in Bang Kruai, Nonthaburi. Our purpose-built campus is located near Ratchapruek Road, about 20 kilometers north of Bangkok and west of the Chao Praya River. Separate buildings for each section, dedicated classrooms, community space, indoor and outdoor playgrounds, a soft-play motor room, and swimming pool for Middle and High School, as well as a swimming pool designed for our youngest learners, students ages 2-5 are given a gentle introduction to school in a warm and caring environment.<br></br><br></br>Our secondary building is currently being constructed. The secondary building will house our middle school and high school programs.",
    "school-map": "SCHOOL MAP"
  },
  "Home": {
    "school-name": "RUAMRUDEE INTERNATIONAL SCHOOL<br></br>RATCHAPRUEK CAMPUS",
    "news": "NEWS",
    "ris-history": "RIS HISTORY",
    "view-all-news": "View all news"
  },
  "Tuition": {
    "title": "TUITION & FEES",
    "click-below": "Click below to view a link or download a PDF:",
    "content": "Tuition & Fees 2022–2023"
  },
  "Scholarship": {
    "title": "SCHOLARSHIPS",
    "scholarship": "SCHOLARSHIP",
    "content": "RISR offers scholarships that support the school's mission while recognizing student achievement — excellence in and out of the classroom and demonstrated leadership. The school awards a variety of scholarships on a competitive basis to incoming and current to exceptional students each year. We also provide need-based financial assistance to qualified families. For more information, please contact the the RISR Admissions Office at:  ",
    "email": "admissions@risr.ac.th"
  },
  "Curriculum": {
    "title": "CURRICULUM",
    "curriculum-content": "RIS follows the American curriculum, which is standards-based. Standards are skills and concept knowledge aligned for the stage of development that corresponds to each grade level.<br></br><br></br>From one grade level to another, students build a progression of standards that deepens their understanding of each content area and enhances their skills. Teachers are highly skilled in using ongoing assessments to understand what concepts and skills students have mastered and what they are ready to learn next. This ensures a rigorous approach for students through differentiation.<br></br><br></br>Standards include the Washington, D.C. Early Childhood Standards and American Education Reaches Out (AERO) standards for our core subject areas of English language, mathematics, and social studies, Next Generation Science Standards (NGSS) for science and ISTE for integrated technology, and standards specific to specialist subjects."
  },
  "Extended": {
    "title": "EXTENDED DAY PROGRAM",
    "edps": "EDPs 2023-2024SESSION 2",
    "regis-form": "Registation form",
    "room-allocation": "Room allocation session 2",
    "edp-policy": "EDP Policy",
    "all-courses": "ALL COURSES",
    "all-courses-sub1": "All courses are 3:00 to 4:00 p.m.<br></br>unless stated otherwise.<br></br><br></br>Suggested grade levels listed below may be slightly flexible.<br></br><br></br>Click the dropdown for more course information.<br></br><br></br>For more info: EDP ",
    "all-courses-sub2": "email: <b>edp@rism.ac.th</b>",
    "all-courses-sub3": "Course details may be subject to change.",
    "ris-extended": "RIS Extended Day Program Policy",
    "sub1": "The Extended Day Program at Ruamrudee International School strives to provide a welcoming, fun, and safe learning environment for students. Courses are designed to challenge, excite, and intrigue children through a variety of different educational fields, including Science, Technology, Mathematics, Sports, and the Arts. Courses are sponsored (taught) by academic professionals from both Ruamrudee International School faculty and outsourced vendors.",
    "sub2": "Each year, we offer three EDP sessions of 8 weeks per session (unless otherwise stated). For the current academic year, RIS has put the following policies into practice to ensure a safe, fair, and well-managed program for our local community.",
    "sub3": "UPDATED NOVEMBER 2023",
    "sub4": "Administered by<br></br>THE REDEMPTORIST FATHERS OF THAILAND<br></br><br></br>Accredited by<br></br>THE MINISTRY OF EDUCATION and THE WESTERN ASSOCIATION OF SCHOOLS AND COLLEGES<br></br><br></br>This policy is developed by RIS administration. The school reserves the right to modify, delete, or add any content as necessary.",
    "acd-title1": "Arts, Crafts and Makerspace with Mr. Danny",

    "acd-sub-title1": "THURSDAYS (PK - Gr. 2)",
    "acd-desc1": "COURSE DESCRIPTION:",
    "acd-sub-desc1": "This EDP is an engaging and fun way to stay creative. Students will be introduced to new materials and techniques through a variety of 2D and 3D workshops.",
    "acd-detail-title1": "INSTRUCTOR:",
    "acd-detail-desc1": "Mr. Danny",
    "acd-detail-title2": "STUDENTS IN CLASS:",
    "acd-detail-desc2": "4 - 10",
    "acd-detail-title3": "PRICE:",
    "acd-detail-desc3": "2,600 THB",

    "acd-title-ballet": "Ballet",
    "acd-sub-title-ballet": "WEDNESDAYS (Gr. 1 - 3)",
    "acd-desc-ballet": "<b>COURSE DESCRIPTION:</b><br></br>",
    "acd-sub-desc-ballet": "Learn ballet basics and choreography.",
    "acd-instructor-title": "INSTRUCTOR:",
    "acd-instructor-desc": "Ms. Prim and Ms. Noon",
    "acd-price-title": "PRICE:",
    "acd-price-desc": "2,400 THB",

    "acd-title-guitar": "Beginner Guitar",
    "acd-sub-title-guitar": "MONDAYS (Gr. 1 - 5)<br></br><br></br>This course is closed for season 3.",
    "acd-guitar-desc": "This course will introduce the basics of guitar playing, including classical guitar guitar and fingerstyle guitar, and will meet the students at their own level. ",
    "acd-guitar-detail1": "Mr. Nopporn",
    "acd-guitar-detail2": "1-5",
    "acd-guitar-detail3": "to be discussed",

    "acd-thai-title": "Beginner Thai Language",
    "acd-thai-sub-title": "THURSDAY (PK4 - 1)",
    "acd-thai-desc": "This course will introduce the Thai alphabet, and teach the basics of reading and writing.",
    "acd-thai-inst": "Ms. Aor",
    "acd-thai-std": "4-6",
    "acd-thai-price": "2,400 THB",

    "acd-bord-game-title": "Board Games",
    "acd-bord-game-sub-title": "TUESDAYS (KG - Gr. 5)",
    "acd-bord-game-desc": "The goal of learning this Board Games is to let students practice thinking and planning in a fun way. In some games students need to play as owner of an organization or entrepreneur administrating businesses. The example of games that will be taught are as follow 1. Werewolf 2. Salem 1692 3. Blokus 4. Braintopia 5. throw throw avocado 6. Deep sea adventure etc. We explain how to play a game in a session and teach them technique to play it effectively. It is a very much fun activity which can play among family and relatives, also some games has been competed seriously in competitions for example Splendor, Catan and Crossword.",
    "acd-bord-game-inst": "Ekkamai Chess",
    "acd-bord-game-std": "20",
    "acd-bord-game-price": "3,840 THB",

    "acd-chess-title": "Chess Club",
    "acd-chess-sub-title": "THURSDAYS (Gr. 1 - 8)",
    "acd-chess-desc": "IWICA Is the only chess school in Asia accredited by Ministry of Education and World Chess Federation and also Thailand Chess Association. We're also recognised by Indian Chess Federation and National Sports Council of Bangladesh.<br></br><br></br>At IWICA CHESS SCHOOL, we strive to improve and advance chess players to international standards of excellence.<br></br><br></br>We only deliver highest quality of coaches and lessons that are approved for competitive chess player to advance and progressively excel. From beginners to advanced level, IWICA Chess SCHOOL allows students to get quality training and expert advice at any time.<br></br><br></br>Its instructors regularly challenge students with new techniques and concepts, and actively model and promote valuable life skills.<br></br><br></br>We're conducting ECA courses with certified curriculum from Beginner to Advanced and Tournament Training levels teaching children from 4 years up to adults. At the end of the term internal tournament is organised and certificate of participation / completion of level is given.<br></br><br></br>BENEFITS OF PLAYING CHESS:<br></br>- Chess raises your kids IQ<br></br>- It increases kid’s problem-solving and critical thinking skills.<br></br>- Chess improves spatial skills.<br></br>- It improves the memory of your child<br></br>- It exercises both side of brain.<br></br>- It increases the creativity of your kid.<br></br>- It improves the concentration your child.<br></br>- Chess teaches planning and foresight.<br></br>- Chess helps prevent Alzheimer’s.",
    "acd-chess-inst": "IWICA",
    "acd-chess-std": "4 - 14",
    "acd-chess-price": "3,600 THB",

    "acd-chess-mark-title": "Chess with Mr. Mark",
    "acd-chess-mark-sub-title": "MONDAYS (Gr. 2 - 8)<br></br><br></br>This course is closed for season 3.",
    "acd-chess-mark-desc": "Want to play chess with your RIS peers? Want to build your skills with our own chess expert? Join our Chess Club for fun matches and skill-building sessions with Mr. Mark and peers. Perfect for students with some chess experience. Let's play and learn together!",
    "acd-chess-mark-inst": "Mr. Mark",
    "acd-chess-mark-std": "4 -15",
    "acd-chess-mark-price": "3,000 THB",

    "acd-chess4kidz-title": "Chess4Kidz",
    "acd-chess4kidz-sub-title": "MONDAYS (PK - KG)<br></br><br></br>This course is closed for season 3.",
    "acd-chess4kidz-desc": "Chess4Kidz is a special program designed for kids ages 3-6 years old by us.<br></br><br></br>CHESS4KIDZ is just not about teaching children how to play chess but we use chess as a tool to teach children important life skills and character building. We don't teach them HOW TO PLAY but HOW TO THINK in chess, and they'll not only know how to play but also how to think out of the box, We can assure that our program will play a very important role in the academic and intellectual development of kids. The program is designed where its intricate playway method is connected with math skills, learning skills and critical and creative development of skills in children.<br></br><br></br>Our unique design program has been honoured with many awards in the UK and India.",
    "acd-chess4kidz-inst": "IWICA",
    "acd-chess4kidz-std": "4 - 20",
    "acd-chess4kidz-price": "3,600 THB",

    "acd-cooking-title": "Cooking",
    "acd-cooking-sub-title": "MONDAYS (PK - 12)",
    "acd-cooking-desc": "Yummy Cookery School was established in 2017 with the intention of promoting life skills through a fun, hands-on activity. Our goal is to introduce our learners to various ingredients at a very young age to prevent them from becoming picky eaters. Our fun cooking lessons are available for children from the age of 3 up to 15 years old. At Yummy Cookery School, we also encourage them to learn kitchen skills and kitchen safety, and our lessons are designed for children from the international school curriculum, which means we encourage decision-making, independent thinking, etc. At the end of each lesson, the students will get to bring the food they made home to enjoy with their parents and siblings, and hopefully, they can use their cooking skills in the household.",
    "acd-cooking-inst": "Yummy Cookery School",
    "acd-cooking-std": "6-20",
    "acd-cooking-price": "5,200 THB",

    "acd-creative-writing-title": "Creative Writing",
    "acd-creative-writing-sub-title": "MONDAYS (PK - 6)<br></br><br></br>This course is closed for season 3.",
    "acd-creative-writing-desc": "Creative writing for kids is more than just a subject taught in school. This is because language shapes the way we perceive the world around us and widens our understanding of different people and possibilities. Whether we come across writing in stories, news articles and fairytales, or in research, signs and coursework instructions, language allows us to communicate with one another and gain knowledge.<br></br><br></br>So where does creative writing for kids come into play? Creating writing skills equip our kids with vital tools to make sense of their emotions, thoughts, and what is happening in the world and in their lives.<br></br><br></br>STUDENT SKILLS<br></br><br></br>Why should students learn Creative Writing?<br></br>Academic success<br></br>Emotional development<br></br>Build self-awareness<br></br>Critical thinking<br></br>Empathy<br></br>Expression<br></br>Learn to win the audience’s attention<br></br>Creative thinking and storytelling skills<br></br><br></br>STUDENT DEVELOPMENT & OUTCOMES<br></br><br></br>What would students get out of this course?<br></br>A new sense of creativity with broadened imagination<br></br>Better self-expression that focuses on written expression but also impacts verbal self-expression<br></br>Ability to express emotions and feelings through channelled creativity<br></br>More self-confidence<br></br>Developed reading, writing and language skills<br></br>A self-published book that students can show off to their friends and family!<br></br><br></br>In each class, students will learn a short lesson on Creative Writing fundamentals and will have hands-on practice on different styles of writing with fun, thought-provoking writing prompts. At the end of the course, students get to take home their own copies of their published book that will be presented to parents and visitors at a book-signing session in the last class.<br></br><br></br>Students will work on planning their writing through carefully curated worksheets pertaining to their levels of difficulty, their work will then go through a proofreading and editing process before they are added into the finalized books. All manuscripts and worksheets will be sent home at the end of the course along with the self-published books, a certificate of completion and a progress report.",
    "acd-creative-writing-inst": "Beyond Books",
    "acd-creative-writing-std": "5-15",
    "acd-creative-writing-price": "5,600 THB",

    "acd-dance-title": "Dance and Choreography with Ms. Holly",
    "acd-dance-sub-title": "THURSDAY (Gr. 4 - 8)<br></br><br></br>This course is closed for season 3.",
    "acd-dance-desc": "A mix of learning new dance moves and choreographing own dances.",
    "acd-dance-inst": "Ms. Holly",
    "acd-dance-price": "2,400 THB",

    "acd-doctor-title": "Doctor Junior",
    "acd-doctor-sub-title": "WEDNESDAYS (KG - Gr. 3)<br></br><br></br>Course is closed for season 3.",
    "acd-doctor-desc": "Doctor Junior is an extra-curricular program designed for primary students in international schools to learn basic medical knowledge and skills. This program aims to teach students about health and safety, the human body, and the importance of medical professionals. Through hands-on activities and role-playing games, students will learn how to provide basic first aid, identify common illnesses and injuries, and understand the importance of hygiene and healthy living. This program will be conducted in English language to support the students' language development.",
    "acd-doctor-inst": "Learn & Play Edutainment",
    "acd-doctor-std": "4-20",
    "acd-doctor-price": "4,500 THB (+1,500 one-time kit purchase)",

    "acd-dot-painting-title": "Dot Painting",
    "acd-dot-painting-sub-title": "FRIDAYS (Gr. 1 - 6)",
    "acd-dot-painting-desc": "The dot painting EDP program is designed by New York dot artist of Bangkok, Amy Diener. With this weekly art class, your child will be taught various dot painting techniques. Students will learn how to make mandala, portrait, animal, and nature dot paintings. Weekly instruction covers various dotting methods, including walking the dots, swooshes, and spirals, each tailored to different skill levels ranging from beginner to advanced practitioners. Students are provided choice and independence in the materials and subject matters throughout the course. Students will get their own kit of art supplies such as dotting tools, acrylic paints, and surfaces such as pendants and canvases to use throughout the course. Amy’s talented team of teachers will be guiding students every step of the way, one dot at a time! This healing art activity encourages mindfulness, focus, and patience. It cultivates balance and peace within the mind, body, and spirit. The process also helps decrease anxiety and depression.",
    "acd-dot-painting-inst": "Khun Noey",
    "acd-dot-painting-std": "6-20",
    "acd-dot-painting-price": "5,280",

    "acd-drama-title": "Drama/Theatre with Ms. Sherwynne",
    "acd-drama-sub-title": "MONDAYS (Gr. 2 - 5)",
    "acd-drama-desc": "Drama Club is where kids can let their imagination take them anywhere! They will learn character building skills, acting skills and possibly some dance skills. Join this club for practice in speaking skills, english language development, and fun peer interaction with a creative, skilled teacher.",
    "acd-drama-inst": "Ms. Sherwynne",
    "acd-drama-std": "4-16",
    "acd-drama-price": "2,400 THB",

    "acd-dream-title": "Dream Builder 3D Architect",
    "acd-dream-sub-title": "WEDNESDAYS (PK - Gr. 3)<br></br><br></br>This course is closed for season 3.",
    "acd-dream-desc": "Dream builder - 3D Design Architect EDP<br></br><br></br>is an engaging extracurricular activity designed for primary students. This program introduces young learners to the exciting world of architectural design and 3D modeling. Through a creative and hands-on approach, students will have the opportunity to:<br></br><br></br>1.Explore Creativity<br></br>2.Develop Problem-Solving Skills<br></br>3.Learn 3D Modeling<br></br>4.Foster Spatial Awareness<br></br>5.Collaboration:<br></br>6.Hands-On Learning<br></br>7.Inspire Future Architects",
    "acd-dream-inst": "Learn&Play Edutainment",
    "acd-dream-std": "5-20",
    "acd-dream-price": "4,000",

    "acd-erc-title": "ERC Robotics",
    "acd-erc-sub-title": "TUESDAYS (Gr. 1 - 9)",
    "acd-erc-desc": "Striving to help students step into the world of Artificial Intelligence and machines, we are introducing the 4th Generation of Educational Robotics, to prepare them for this new challenging era of technology, innovation and creativity. This activity is purely a hand on projects base and advanced Programming to engage kids to tech lab, engineering and having an exceptional time with the STEM concept. It will train kids to communicate through code, develop logical thinking and crack missions using building skills to create robots and coding skills to command them.<br></br>3 MAJOR ROBOT MATERIALS SOFTWARES WILL BE INTENSIVELY USED: - SENIOR ROBOTICS FOR KIDS OF AGE 9-16: - XIAOMI TECH - SUPER:BIT - MICROBIT SENSOR<br></br>- JUNIOR ROBOTICS FOR KIDS OF AGE 5-8: - WEDO - XIAOMI SMART BUILDER",
    "acd-erc-inst": "I-ZONE",
    "acd-erc-std": "4-20",
    "acd-erc-price": "3,600 THB",

    "acd-es-choir-title": "ES Choir",
    "acd-es-choir-sub-title": "THURSDAY (Gr. 3-5)",
    "acd-es-choir-desc": "Do you love to sing? Do you love the feeling of making music with others? Do you want the chance to perform in the community? Come join us for choir!",
    "acd-es-choir-inst": "Ms. Baylee and Ms. Colleene",
    "acd-es-choir-std": "4-20",
    "acd-es-choir-price": "2,400 THB",

    "acd-explorative-dance-title": "Explorative Dance with Ms. Laura",
    "acd-explorative-dance-sub-title": "TUESDAY (Gr. 4 - 5)<br></br><br></br>This course is closed for season 3.",
    "acd-explorative-dance-desc": "I was born and raised in the Caribbean, where casino, rumba, reggaeton and other dance styles are very popular. While we will not be learning all of them, the students will be able to explore some salsa and other latin rhythms, as well as other dances they may be interested in, such as Kpop.<br></br>We will begin the course exploring their current skills and music preferences.<br></br>The classes will be structured in a way that in each session I would be teaching them some dance steps or movements and then we will practice them with a song.<br></br>Students will be given as well the opportunity to explore their own strengths in dancing, by allowing them to improvise with each rhythm!<br></br><br></br>My goal is for students to ENJOY learning and dancing in the different sessions.",
    "acd-explorative-dance-inst": "Ms. Laura",
    "acd-explorative-dance-price": "2,400 THB",

    "acd-edesign-title": "eDesign and 3D Printing",
    "acd-edesign-sub-title": "MONDAYS (Gr. 1 - 5)",
    "acd-edesign-desc": "In this activity, we combine the printing technology and handicrafts work to bring creative design and ART to tangible 3D shapes. This activity will develop and turn kids into great designers of shapes and objects. Training them to use 3D pen machines PLA(for age 9-14) / PCL(for age 5-8) and filaments to transform their Art, Drawing and Design work into 3 dimensional objects.<br></br><br></br>Classes will go into steps as; Design –Self design –Modeling –filament color selection –safety check –printing –adjustment & fixing –self creative, to allowing kids to produce 2D and 3D models that they are taking home, to use it as a souvenir or even to become useful at home.",
    "acd-edesign-inst": "ME-IZONE",
    "acd-edesign-std": "4-20",
    "acd-edesign-price": "3,600 THB",

    "acd-esport-title": "eSports",
    "acd-esport-sub-title": "MONDAYS (Gr. 1 - 6)<br></br><br></br>This course is closed for season 3.",
    "acd-esport-desc": "e-sports<br></br><br></br>In this e-sport class we focus on playing physically by using motion sensor equipment for most of the sessions.\"Electronic sports\" is a form of competition using video games. we will have sensor equipment (eg. Joy-Con) for each student so everyone will have one equipment. Nowadays e-sport have been competed widely, for example in SEA games, Asian games etc., those games that are included such as FIFA and Starcraft.<br></br><br></br>The example outline<br></br>- e-tennis<br></br>- Mario party 1<br></br>- e-volleyball<br></br>- bomberman<br></br>- e-bowling<br></br>- Mario party 2<br></br>- e-golf<br></br><br></br>Benefits of playing e-sports<br></br>- Reduced Stress, relaxation<br></br>- Physical health<br></br>- Diverse Social Connections<br></br>- Reduced Body Fat<br></br>- Team work etc.",
    "acd-esport-inst": "Unisus",
    "acd-esport-std": "3-8",
    "acd-esport-price": "4,640 THB",

    "acd-gymnastics-title": "Gymnastics",
    "acd-gymnastics-sub-title": "MONDAYS (PK - Gr. 12)",
    "acd-gymnastics-desc": "Athletes will train on different gymnastics apparatuses from beginner to more advanced gymnastics levels. Athletes will develop their muscles, flexibility, and harder gymnastics skills.",
    "acd-gymnastics-inst": "Thai Canadian Gymnastics",
    "acd-gymnastics-std": "15",
    "acd-gymnastics-price": "5,600 THB",

    "acd-inline-skating-title": "Inline Skating",
    "acd-inline-skating-sub-title": "MONDAYS (KG - Gr. 5)",
    "acd-inline-skating-desc": "BKK Skating School is the first International Skating school in Thailand.<br></br>We follow the 5-level Inline Skating curriculum accredited by the World skate organization. Inline skating or Rollerblading is a great activity for boys and girls.<br></br>After only one or two lessons most children are able to find their balance and can skate on their own. That’s when students fall in love with the sport and gain confidence to learn more. Skating helps develop autonomy in children, discovering their strengths and limitations, taking learning into their own hands. Inline skating helps children keep fit while having fun, encouraging fast decision making and leadership skills.<br></br>There are many other physical and health benefits including; increased endurance & body strength, improved coordination, balance, reflexes and flexibility.<br></br>As students master the art, movement becomes natural, helping to clear the mind and relieve stress. Skating is simply great fun!",
    "acd-inline-skating-inst": "Learn&Play Edutainment",
    "acd-inline-skating-std": "4-20",
    "acd-inline-skating-price": "4,000 THB",

    "acd-japanese-beginer-title": "Japanese for Beginners",
    "acd-japanese-beginer-sub-title": "THURSDAYS (Gr. 6 - 12)",
    "acd-japanese-beginer-desc": "This program is designed for students who have little to no experience with the Japanese language. Throughout the course, we will focus on building a foundation of basic vocabulary and grammar, with an emphasis on practical conversational skills. Additionally, we will explore various aspects of Japanese culture to help you gain a deeper understanding of the language and its context.",
    "acd-japanese-beginer-inst": "Ms. Megumi",
    "acd-japanese-beginer-std": "4 - 20",
    "acd-japanese-beginer-price": "2,400 THB",

    "acd-japanese-native-title": "Japanese for Native Speakers",
    "acd-japanese-native-sub-title": "FRIDAY (Gr. 6 - 12)<br></br><br></br>This course is closed for season 3.",
    "acd-japanese-native-desc": "This course is designed for Japanese native speakers who want to enhance the reading and writing skills. We will learn Japanese language through newspapers, website/magazine articles, and short stories that have been adapted to suit the students' proficiency level.",
    "acd-japanese-native-inst": "Ms. Megumi",
    "acd-japanese-native-std": "4 - 20",
    "acd-japanese-native-price": "2,400 THB",

    "acd-junior-inventor-title": "Junior Inventor",
    "acd-junior-inventor-sub-title": "FRIDAYS (PK - KG)<br></br><br></br>Course is closed for season 3.",
    "acd-junior-inventor-desc": "Junior Inventor is a specialized program with hardware and software platform specifically designed for Kindergartens children ages 4-6 years old.<br></br><br></br>Students quickly learn the simple click-and-drag icons to activate a motor, which might also be dependent on a sensor, in a logical and sequential schema. The course gives handson and introduction of what robots and 21st century technology to toddlers bring to the positive impact of machines making them creative.<br></br><br></br>This program is perfect for kids ideally 3-6 years of age in which it offers an educational tool for kids to think out of the box. Many times kids have ideas of what they dream to create.<br></br><br></br>**CERTIFICATION OF COMPLETION IS AWARDED TO ALL STUDENTS AT THE END OF THE TERM.",
    "acd-junior-inventor-inst": "IWICA",
    "acd-junior-inventor-std": "4 -12",
    "acd-junior-inventor-price": "4,400 THB",

    "acd-makerspace-stem-title": "Makerspace STEM Challenge with Ms. Ashley",
    "acd-makerspace-stem-sub-title": "WEDNESDAY (Gr. 1 - 3)",
    "acd-makerspace-stem-desc": "In our Makerspace STEM class for students grades 1-3, young innovators explore hands-on activities while fostering creativity and problem-solving skills. Through engaging projects and age-appropriate challenges, students develop a foundational understanding of STEM concepts and design thinking.",
    "acd-makerspace-stem-inst": "Ms. Ashley",
    "acd-makerspace-stem-std": "4 - 10",
    "acd-makerspace-stem-price": "2,800 THB",

    "acd-mathemagic-title": "MatheMagic",
    "acd-mathemagic-sub-title": "WEDNESDAYS (PK - Gr. 1)<br></br><br></br>This course is closed for season 3.",
    "acd-mathemagic-desc": "1. The ability to work sums in your head is an important skill that kids must develop throughout the key stages starting from kindergarten specially in a play way method.<br></br>2.<br></br>3. Children will always be taught to calculate in their head, but it’s not until they're 6 years and above. Our program specially designed for toddlers will make them start to learn specific strategies to understand numbers, count and plan mathematical strategies mentally. We work in a number of ways to work mental maths practice into everyday situations as per their age group and at the same time make math always be a fun subject to them.<br></br>Some of the immediate benefits in kids are Activate left and right brain work together, Speed and Mental Math, Rapid Calculation, Remove Maths Phobia and make it fun and easy.",
    "acd-mathemagic-inst": "Mr. Win Panyaparichot",
    "acd-mathemagic-std": "4-20",
    "acd-mathemagic-price": "3,600 THB",

    "acd-mobile-app-development-title": "Mobile Application Development",
    "acd-mobile-app-development-sub-title": "TUESDAYS and THURSDAY (Gr. 1 - 8)<br></br><br></br>This course is closed for season 3.",
    "acd-mobile-app-development-desc": "*This course is held two days a week.<br></br><br></br>Project #1 Task Planner<br></br>Project #2 Smart Money Management<br></br>Project #3 Social Community Engagement",
    "acd-mobile-app-development-inst": "Mardodi Code Camp",
    "acd-mobile-app-development-std": "10-30",
    "acd-mobile-app-development-price": "6,000 THB",

    "acd-muaythai-title": "MuayThai",
    "acd-muaythai-sub-title": "TUESDAYS (KG - Gr. 8)",
    "acd-muaythai-desc": "Aiming to know basic Muay-Thai such as:<br></br>1. Muaythai standing posture.<br></br>2. Different kind of body movements in Muay-Thai.<br></br>3. Muaythai punching methods (Straight punch, Hook Punch, Uppercut Punch  Overhead punch ) and techniques<br></br>4. Muaythai kicking methods and techniques<br></br>5. Using elbow techniques (Straight elbow, Uppercut elbow, Kratung elbow, Hook elbow, Overhead elbow, move back elbow) in Muay-Thai.<br></br>6. Using knee techniques in Muay Thai.",
    "acd-muaythai-inst": "Mr. Win Panyaparichot",
    "acd-muaythai-std": "3 -12",
    "acd-muaythai-price": "2,900 THB",

    "acd-music-movement-title": "Music and Movement with Ms. Sharon",
    "acd-music-movement-sub-title": "TUESDAYS (PK4 - Gr. 1)<br></br><br></br>This course is closed for season 3.",
    "acd-music-movement-desc": "Children will get a little silly as we sing, dance, and play movement games. They will also color pages with the song lyrics to take home and share with their families. This will be a fun time for any kid who loves singing and dancing, and it’s a great way for young English learners to build their vocabulary!",
    "acd-music-movement-inst": "Ms. Sharon",
    "acd-music-movement-price": "2,400 THB",

    "acd-parkour-title": "Parkour with Mr. Mark",
    "acd-parkour-sub-title": "TUESDAY (Gr. 4-5)",
    "acd-parkour-desc": "Challenge yourself with our After-School Parkour Program led by Mr. Mark! Create and embark on exciting adventures, push your limits, and further develop your movement skills while having fun.",
    "acd-parkour-inst": "Mr. Mark V.",
    "acd-parkour-std": "4-20",
    "acd-parkour-price": "2,400 THB",

    "acd-public-speaking-title": "Public Speaking",
    "acd-public-speaking-sub-title": "WEDNESDAYS (Gr. 1 - 6)",
    "acd-public-speaking-desc": "In this course students will explore the fundamentals of Public Speaking and learn the fundamentals.<br></br><br></br>They will also explore different types of public speaking such as persuasive speech, informative speech, commercials, narrative experiences and emotions in public speaking.",
    "acd-public-speaking-inst": "Beyond Books",
    "acd-public-speaking-std": "5 -15",
    "acd-public-speaking-price": "5,600 THB",

    "acd-storytelling-title": "Storytelling Early Years",
    "acd-storytelling-sub-title": "FRIDAYS (PK4 - Gr.1)<br></br><br></br>This course is closed for season 3.",
    "acd-storytelling-desc": "Human beings are natural storytellers. We tell stories with everything we do. From our historical texts, when we create an art piece, when we call our friends to share the most exciting thing about our days, when we send out a sales pitch to a client to the time we tuck our children to sleep at night, we are made of stories. We are made to tell stories.<br></br><br></br>Storytelling is also the oldest form of teaching. It bonded the early human communities, giving children the answers to the smallest and biggest questions of life. Stories define us, shape us and make us. Every single culture tells stories.<br></br><br></br>Stories create magic and a sense of wonder at the world. Stories teach us about life, about ourselves and about others. Storytelling is a unique way for kids to develop an understanding, respect and appreciation for other cultures while widening their imagination.<br></br><br></br>Course Overview<br></br><br></br>This document will highlight what will be covered in the Storytelling - Early Years course offered by Beyond Books. Each session will focus on storytelling aspects through different individual and group-based activities. Students will work on activities in activities in circles, each group exploring a different activity for each week of the class.<br></br><br></br>Students will have hands-on practice creating stories through worksheets, simple sentences, drawing, magnetic boards, stickers, stamps, puppets and other manipulatives as they explore different fundamentals and types of storytelling as they build their confidence and sharing.<br></br><br></br>Student Outcomes<br></br><br></br>Beyond Books follows a formula of:<br></br><br></br>Lesson + Activity = Outcome<br></br><br></br>In each class, students will work on telling a story using manipulatives focused on themes. Students will use the storytelling fundamentals focused on for each class to present their stories. These stories and their projects (puppets, story settings using manipulatives, sentences and drawings) will be showcased through a digital portfolio, which will include videos of student presentations in each class. Each student will also receive a progress report as well as a certificate of completion at the end of the course.<br></br><br></br>*A consent form will be sent for parents to declare consent to take videos of their child’s speeches. These recordings shall be made available to the parents of the individual student, the school representative and Beyond Books only. These videos will be shared in the form of a Google Drive folder after the completion of the course and will be permanently deleted after 30 days.",
    "acd-storytelling-inst": "Beyond Books",
    "acd-storytelling-std": "5 -15",
    "acd-storytelling-price": "6,000 THB",

    "acd-rubik-cube-title": "Rubik's Cube",
    "acd-rubik-cube-sub-title": "THURSDAYS (KG - Gr.3)<br></br><br></br>This course is closed for season 3.",
    "acd-rubik-cube-desc": "Invented in 1974 by Ernõ Rubik, a professor from Budapest in Hungary, the colourful puzzle was initially dreamed up as a device to help students achieve a better understanding of 3-D spaces.<br></br>Hisfirst prototype- then ‘Magic Cube’ was such a success with his students that Rubik persisted in patenting the invention, bringing it to worldwide mass production in 1980. Today, the Rubik’s Cube is one of the most famous toys of all time!<br></br>Drawing on the success of the 3×3,many variations of the original cube were designed and are in high demand.<br></br>Our program designer, Asia Konvittayayotin is the 2019 Thai Champion. He has been breaking asian records since he started seven years ago. He is the best Rubik's Cube player Thailand has ever had.",
    "acd-rubik-cube-inst": "Learn & Play Edutainment",
    "acd-rubik-cube-std": "4 - 20",
    "acd-rubik-cube-price": "4,000 THB",

    "acd-surfskate-training-title": "SurfSkate Training",
    "acd-surfskate-training-sub-title": "WEDNESDAY (Gr. 1 - 8)<br></br><br></br>This course is closed for season 3.",
    "acd-surfskate-training-desc": "Surfskate Training (Beginner - Intermediate) by School of Miller focuses on skill development and safety. The curriculum covers basic fundamentals and foundations including riding, proper stance, posture, body position and speed generation. Our training is taught by Miller Division Professional Instructors and is suitable for all levels of riders. Surfskating techniques transfer to all kinds of board sports (skateboarding, surfing, snowboarding, sup-boarding and wakeboarding), and with a coach to student ratio of 1:3 skill developement is guaranteed regardless of a child's prior experience.<br></br>With safety as our priority, all participants will be provided with a surf-skate board, helmet and safety gear which includes a helmet and pads for hands, elbows and knees which, must be worn at all times during the training. Students are allowed to use their own equipment as long it passes our safety check.<br></br>See our catalogue of products HERE (https://linktr.ee/millerdivisionofficialth) and receive a 30-50% RIS discount!",
    "acd-surfskate-training-inst": "The Flatland Co.",
    "acd-surfskate-training-std": "3-15",
    "acd-surfskate-training-price": "5,520 THB",

    "acd-table-tennis-title": "Table Tennis",
    "acd-table-tennis-sub-title": "THURSDAYS (Gr. 4 - 8)",
    "acd-table-tennis-desc": "This is the perfect opportunity to immerse your child in a new and exciting sport! Table Tennis is a great way for students to develop a wide range of abilities. Students will improve on spatial awareness, develop motor skills, concentration, reflexes, and strategy - all while having fun! Try out our Table Tennis Class at RIS!<br></br><br></br>Did you know? Mr. Julius used to coach table tennis prior to working as a counselor.",
    "acd-table-tennis-inst": "Mr. Julius",
    "acd-table-tennis-std": "4-10",
    "acd-table-tennis-price": "2,800 THB",

    "acd-taekwondo-title": "Taekwondo Club",
    "acd-taekwondo-sub-title": "THURSDAYS (KG - Gr. 6)",
    "acd-taekwondo-desc": "1. Developing self-defense skills of both male and female.<br></br>2. Developing agility and flexibility of body and joints movement.<br></br>3. Developing functionality of body systems such as muscular system, digestive system, respiratory system, and cardiovascular system.<br></br>4. Developing sense of fatigue, activeness, physical and mental health.<br></br>5. In Child, Taekwondo helps solving emotional problem, depression, anxiety, lack of self - esteem, diffidence, fear of self - expression, lack of social skill, less social adaptability, and ill-health. Since child is the age in which mental and physical energy is at extreme state, their reaction or impulsive action is hence more intense than in childhood.",
    "acd-taekwondo-inst": "Teacher Beer",
    "acd-taekwondo-std": "10-25",
    "acd-taekwondo-price": "4,000 THB",

    "acd-young-pilot-title": "Young Pilot Adventure",
    "acd-young-pilot-sub-title": "THURSDAYS (Gr. 4 - 6)<br></br><br></br>This course is closed for season 3.",
    "acd-young-pilot-desc": "The Young Pilot Academy is a comprehensive course designed for students interested in learning how to fly simulation airplanes. Through hands-on instruction and interactive training, students will take control of simulation instruments and learn the basics of flying, including takeoff, landing, and navigation. The course covers all the necessary information and skills required to become a proficient pilot, including flight planning, aircraft systems, and weather theory.",
    "acd-young-pilot-inst": "IONIA",
    "acd-young-pilot-std": "6-8",
    "acd-young-pilot-price": "4,400 THB"
  },
  "Overview": {
    "title": "OVERVIEW",
    "established": "ESTABLISHED",
    "established-sub": "1957",
    "website": "WEBSITE",
    "website-sub": "WEBSITE",
    "address": "ADDRESS",
    "address-sub": "Ruamrudee International School Ratchapruek Campus<br></br>999 Moo 4 Bang Kruai-Sai Noi Road, Bang Krang<br></br>Nonthaburi, Nonthaburi 11000 Thailand",
    "email": "EMAIL",
    "email-sub1": "<b>info@rism.ac.th</b>",
    "email-sub2": "<b>admissions@rism.ac.th</b>",
    "phone": "PHONE",
    "phone-sub": "+66 (0)2 791 8900",
    "curriculum": "CURRICULUM",
    "curriculum-sub": "RIS offers a modified American curriculum. Pre-K follows a learning and development continuum based on the Reggio Emilia approach to learning. Core subjects from Kindergarten to Middle School are aligned with the American Education Reaches Out (AERO) standards. High school students can choose between the International Baccalaureate (IB) Diploma Program and the Advanced Placement (AP) program.",
    "accreditation": "ACCREDITATION",
    "accreditation-sub": "WASC (Western Association of Schools and Colleges), Thai Ministry of Education",
    "affiliations": "AFFILIATIONS",
    "affiliations-sub": "Redemptorists of Thailand, International Baccalaureate (IB), CollegeBoard (AP), EARCOS (East Asia Regional Council of Overseas Schools), CIS (Council of International Schools), ISAT (International Schools Association of Thailand), ONESQA (Office for National Education Standards and Quality Assessment)",
    "enrollment": "ENROLLMENT",
    "enrollment-sub": "1,100 students",
    "ages": "AGES",
    "ages-sub": "3 (Pre-K 3) to 18 (Grade 12)",
    "ratio-teaching": "RATIO OF TEACHING STAFF TO STUDENTS",
    "ratio-teaching-sub1": "Pre-K – Kindergarten: 18 students / class (1 teacher, instructional aide & nanny)",
    "ratio-teaching-sub2": "Grades 1–5: 22 students / class (1 teacher & instructional aid)",
    "ratio-teaching-sub3": "Grades 6–12: 22 students / class (multiple subject specialist teachers)",
    "fees": "FEES",
    "fees-sub": "400,000 baht per year (Pre-K) to 700,000 baht per year (Grade 12), not including registration, campus development, and other fees. ",
    "other-campuses": "Other campuses",
    "other-campuses-sub": "Ruamrudee International School Early Years Campus (Phraya Suren Road, Ramintra-Kanchanapisek area) and Ruamrudee International School Ratchapruek Campus (Bang Kruai-Sai Noi Road, Bang Krang, Nonthaburi)"
  },
  "Vision": {
    "title": "VISION & MISSON",
    "vision": "VISION",
    "vision-sub": "Ruamrudee International School will be known globally as a hallmark of international education, and physical well-being, while fostering compassion through action and shaping the lives of tomorrow's leaders.",
    "mission": "MISSION",
    "mission-sub": "Ruamrudee International School is a Catholic school that provides an interfaith, inclusive, and academically rigorous education for students to be balanced, successful, and compassionate individuals.",
    "ris-sub": "The school seal portrays a globe with the initials RIS below it. The lines of longitude represent the international nature of the school. The impression of a church with a flag atop its roof signifies the Christian spirit of family love that has always characterized the school community, preparing RIS students to be good and responsible citizens of the world.<br></br><br></br>The school motto is engraved in the RIS Senior pin, which is shaped like a shield and bears the Latin words Ad Astra above the symbol of a cross and five stars. Translated “to the stars,” Ad Astra encourages every student to aim for the best, not only in their education but also in their personal and spiritual growth. <br></br><br></br>The school colors are white and blue with a splash of red. As in the Thai National flag, these colors exemplify loyalty and patriotism with school spirit and moral inspiration.",
    "sub2": "Together with the senior gown, the pin is presented at the traditional Senior Convocation held at the beginning of each academic year, to impress upon each student the responsibilities that come along with the privileges of being a senior.",
    "sub3": "The school’s sports mascot is “The Phoenix,” a symbol of strength and excellence. In Egyptian mythology, the phoenix is a beautiful bird that consumes itself by fire every 500 years to rise anew from its ashes. ",
    "studen-learner": "STUDENT LEARNER OUTCOMES(PRINCIPLES OF PHOENIX)"
  },
  "Leadership": {
    "title": "Leadership Team",
    "title1": "A MESSAGE FROM THE SCHOOL DIRECTOR",
    "sub1": "The RIS motto Ad Astra means ‘to the stars.’ While we certainly encourage our students to reach for the stars academically, we also take pride in the personal and spiritual growth of our students… For over six decades, RIS has fostered amazing students and alumni. I am honored to be here and be part of its legacy.<br></br><br></br>Rev. Fr. Jittapol Plangklang, C.Ss.R.<br></br>School Director",
    "title-camp1": "M.S.Ed. (School & Mental Health Counseling)",
    "sub-camp1": "University of Pennsylvania",
    "title-camp2": "M.A. (Spirituality)",
    "sub-camp2": "Fordham University, New York",
    "title-camp3": "M.A.T. (Religious Education)",
    "sub-camp3": "Ateneo de Davao University, Philippines",
    "title-camp4": "B.A. (Philosophy & Religion)",
    "sub-camp4": "Saengtham College, Thailand",
    "title-camp5": "Certificate in Advanced Education Leadership",
    "sub-camp5": "(Harvard University, Cambridge)",
    "title-camp6": "Certificate in School Management & Leadership",
    "sub-camp6": "(Harvard University, Cambridge)",
    "title-camp7": "Mental Health Specialist Certificate",
    "sub-camp7": "(American School Counselor Association)",
    "title-camp8": "School Counseling Data Specialist Certificate",
    "sub-camp8": "(American School Counselor Association)",
    "title2": "A MESSAGE FROM THE HEAD OF SCHOOL",
    "sub2": "At RIS, we live by the Principles of the Phoenix (PoPs): Head (knowledge) through our students’ academic talents… Hands (skills) through the never-ending opportunities for our students to take part in athletics, activities, and our extended day programs… Heart (values) through all the service-oriented club activities and countless other ways our students choose to give back to the community. There is truly an ideal track for just about every student at RIS, and I could not be more proud to be part of it! <br></br><br></br>Dr. Jim O’Malley<br></br>Head of School / High School Principal",
    "title3": "A MESSAGE FROM The SENIOR ADVISOR TO THE RIS LEADERSHIP TEAM",
    "sub3": "RIS has a long and successful history of providing strong academic programs integrated within a moral and ethical framework. We inspire our students to aim at excellence, and while any school can build leaders, I believe RIS builds great leaders. In the spirit and the meaning of Ruamrudee, Union of Hearts, we work together to nurture intellectual development, foster compassion, and shape the lives of tomorrow’s leaders. <br></br><br></br>Rev. Fr. Apisit Kritsaralam, C.Ss.R.<br></br>Senior Advisor to the RIS Leadership Team ",
    "title-camp9": "Ed.D. (Educational Leadership & Policy)",
    "sub-camp9": "Florida State University",
    "title-camp10": "M.S. (Educational Leadership)",
    "sub-camp10": "University of Central Florida",
    "title-camp11": "B.A. (Physical Education)",
    "sub-camp11": "Florida State University",
    "title-camp12": "Graduate Certificate in Program Evaluation",
    "sub-camp12": "(Florida State University)",
    "title-camp13": "M.Ed. (Counseling)",
    "sub-camp13": "Loyola University, Chicago",
    "title-camp14": "M.A. (Spirituality)",
    "sub-camp14": "Fordham University, New York",
    "title-camp15": "B.A. (Theology)",
    "sub-camp15": "Saengtham College, Thailand",
    "title-camp16": "B.A. (Philosophy & Religion)",
    "sub-camp16": "Saengtham College, Thailand",
    "title-camp17": "Certificate of Advanced Studies in Educational Sciences",
    "sub-camp17": "(Catholic University of Leuven)"
  },
  "Elementary": {
    "title": "ELEMENTARY SCHOOL",
    "title1": "ages 5-10",
    "sub1": "Elementary School includes our students in Kindergarten to Grade 5. RIS provides a rigorous academic program that integrates students’ social and emotional development. All of our elementary school teachers are highly qualified and certified within their specific subject areas.<br></br><br></br>Many of our teachers have additional certifications in reading, language development, and learning support. But that is not what makes our Elementary program such a special place; it is the warm, caring environment that facilitates learning and builds character, preparing our students for middle school, high school, college, and life. We take pride in nurturing the student-centered learning environment we provide for our children.",
    "curriculum": "CIRRICULUM",
    "curriculum-sub": "Core subjects are based on the American Education Reaches Out (AERO) standards and taught by the grade-level classroom teachers. We integrate the Fountas and Pinnell Literacy Continuum within a Readers and Writers Workshop to provide a balanced literacy model, and science and math are inquiry-based courses with a focus on critical thinking—all skills that are vital for success in the future. Across all grades, students have access to devices and lessons about the proper use of technology so teachers and students can safely use digital tools and resources in innovative and creative ways. In Kindergarten through grade 2, each student has access to an iPad, and in grades 3–5, RIS has a 1:1 Chromebook program.",
    "sub2": "Beyond the core subjects of math, reading, writing, science, and social studies, your child will have daily opportunities to experience and explore other interests and talents in their specialist subjects—art, music, physical education, a second language, and values. Our students are also introduced to skills and concepts in health and wellness. All elementary students are required to take Thai language and literacy, and our non-Thai students also learn about Thai culture. Collectively, these subjects not only offer elementary students a well-rounded school experience, but they help our children learn how to be considerate global citizens who are aware of the importance of caring about other people and our environment.<br></br><br></br>Our students’ social and emotional well-being is further supported by the Second Step curriculum. All of our teachers are skilled at adapting learning to individual student’s needs and meeting them where they are, developmentally. In all grades, we encourage students to make appropriate choices and exercise their independence, which promotes autonomy and a sense of safety—all of which are essential in developing well-adjusted, happy children who can focus on their learning.<br></br><br></br>The English Language Development Program (ELD) recognizes that one of the top priorities in a quality international education is the attainment of an academic-level of English fluency. English language learners are designated by their level of proficiency, from beginner to advanced, and each level requires matched instructional strategies to facilitate rapid skill development.<br></br><br></br>At RIS Ratchapruek, ELD students are immersed in a rich English-speaking environment and selectively enrolled in core mainstream subjects to give them frequent opportunities to interact with classmates and teachers. ELD students also get individualized support to accelerate their academic success.",
    "sub3": "Small-group pull-out and language support classes provide specialized learning time where content instruction and the development of English skills are closely integrated. Push-in support gives English language learners help within mainstream classes.<br></br><br></br>RISR uses MAP NWEA and WIDA MODEL assessments to track progress in English language and academic skill development throughout the year, informing differentiation that supports each child's unique needs.",
    "sub4": "Click here to view the <a>Student-Parent Handbook.</a>"
  },
  "History": {
    "header": "HISTORY",
    "title1": "OVER 60 YEARS OF EXCELLENCE IN EDUCATION",
    "sub1": "In 1957, the Redemptorists of Thailand formed the idea for a school to meet the educational and catechetical needs of children of expatriate and local Catholic parishioners. A makeshift school officially opened on May 17 of that year—designated RIS Foundation Day—with four wooden classrooms behind Holy Redeemer Church. In 1963, what was then known as Ruam Rudi School (RRS) was officially chartered under the Thai Ministry of Foreign Affairs and renamed Ruamrudee International School (RIS). ",
    "sub2": "May 17, 1957, is the designated Foundation Day of RIS. This photo, dated November 1965, was when new buildings were completed and blessed in an official school opening ceremony. What was then known as Ruam Rudi School (RRS) was later officially renamed Ruamrudee International School (RIS).",
    "sub3": "“Ruamrudee,” Thai for “union of hearts,” perfectly encapsulates the RIS philosophy of welcoming all children, emphasizing social responsibility, and ensuring a warm learning environment. RIS became one of the first schools in Asia to be fully accredited by WASC (the Western Association of Schools and Colleges) and the Thai Ministry of Education, and in 1992, moved from its original Soi Ruamrudee campus in downtown Bangkok to its current location in Minburi. An IB World School since 1998, RIS is one of few schools in Thailand to offer both the International Baccalaureate Diploma Program and Advanced Placement tracks. ",
    "sub4": "Ruamrudee International School, founded in 1957, was originally located in Soi Ruamrudee 5 in downtown Bangkok.",
    "sub5": "RIS students consistently prove their academic excellence by scoring far above world averages and attending the most prestigious colleges and universities around the world. RIS students benefit from small class sizes, relevant and innovative electives, modern languages, and a vibrant performing and visual arts program. The Student Services department, led by a school psychologist, ensures that the English Language Development and Learning Support programs meet the diverse needs of all students. ",
    "sub6": "Fr. Thomas Griffith, founder of the RIS Minburi campus, surveys the new RIS admin building with Fr. Leo Travis & Fr. Patrick Morrissey in the early 90s.",
    "sub7": "RIS Ratchapruek opened in August 2019 in Bang Kruai, Nonthaburi. Our purpose-built campus is near Ratchapruek Road and approximately 20 kilometers north of Bangkok and west of the Chao Praya River.<br></br><br></br>Our Secondary Building is currently under construction. The Secondary Building will be the home of our middle school and high school programs.",
    "our-campus": "OUR CAMPUS",
    "sub8": "RIS Ratchapruek"
  },
  "PreK": {
    "header": "Pre-Kindergarten",
    "title1": "AGES 2-5",
    "sub1": "At the RIS Ratchapruek Campus, Pre-K students learn in their own pod. With dedicated classrooms, community space, indoor and outdoor playgrounds, a soft-play motor room, and even a swimming pool designed for our youngest learners, students ages 2–5 receive a gentle introduction to school in a warm and caring environment.<br></br><br></br>At the RIS Ratchapruek Campus, Pre-K students learn in their own pod. With dedicated classrooms, community space, indoor and outdoor playgrounds, a soft-play motor room, and even a swimming pool designed for our youngest learners, students ages 2–5 receive a gentle introduction to school in a warm and caring environment.",
    "curriculum": "CIRRICULUM",
    "curriculum-sub": "The Early Childhood program at RIS Ratchapruek reflects the Reggio Emilia approach in its belief that all children have an interest in constructing their own knowledge and that they interact with everything the environment brings to them. Our teachers follow the children’s interests to shape the units of inquiry. Each group of students is unique, with unique interests, and so while the units may vary from year to year, it follows a learning and development continuum based on Early Childhood standards.<br></br><br></br>Our Pre-K curriculum is based on the District of Columbia’s Common Core Early Learning Standards that define what preschool children should know and be able to do before they enter kindergarten. These Early Learning standards direct teachers’ instructional planning through developmentally appropriate guidelines that meet our children at their current developmental stage.<br></br><br></br>Early Childhood is a very specialized area within education, requiring very special teachers. All of our Pre-K teachers are certified and trained in Early Childhood education. Each grade level (Pre-K 2, 3, and 4) has a certified Early Childhood Special Educator on its team, as well as Instructional Assistants, nannies, and a dedicated janitorial and canteen team.",
    "sub2": "Lessons include literacy, math, and social and emotional topics that might come up in their young lives. Lessons are presented through hands-on demonstrations, purposeful visuals, and lots of singing. Students then choose and rotate through interest centers—role-play, writing, science exploration, light and shadows, and construction, to name a few. Our Pre-K children also attend specialist classes throughout the week including music, art, computers, library, physical education, and Thai. Students have a healthy snack in the morning and eat lunch in our separate canteen purposely built for our youngest students. The day ends with nap time in the classroom and an afternoon snack before returning home.",
    "sub3": "Click here to view the <b>Student-Parent Handbook.</b>"
  },
  "MiddleSchool": {
    "header": "MIDDLE SCHOOL",
    "title1": "AGES 11-13",
    "sub1": "The Middle School program is designed to increase cohort learning experiences across skill and grade levels. Cohort learning is proven to:",
    "sub2": "improve academic performance due to enhanced feelings of support and connection",
    "sub3": "increase exposure to diverse ideas and perspectives",
    "sub4": "give the support and motivation needed to strive and reach for higher expectations",
    "sub5": "provide experience relative to real world group and interpersonal skills",
    "sub6": "increase learners' abilities to generalize and transfer experiences into further environments",
    "curriculum": "CIRRICULUM",
    "curriculum-sub": "Benefits of cohort learning included skill development in the following areas:<br></br>Collaboration: With facilitation on social interaction and collaboration with peers, cohort learning enhances learning experiences and overall sense of community Continuation of Learning: As students advance through learning experiences, cohort learning allows for teachers to individually structure the learning needs to each individual. Group abilities provide continued support as skill progression advances.<br></br>Support: Cohort learning connects learners with the support of their peers and teachers. Active engagement and encouragement extend learning opportunities<br></br>Perspective: Cohort learning expands learners’ perspectives. As engagement with others increases, students are exposed to new choices, opinions, experiences and ideas.",
    "title2": "MIDDLE SCHOOL COURSES",
    "sub7": "Students will have both compulsory and elective courses in middle school. Compulsory classes include humanities, math, and science.<br></br>Middle school students will solidify their research, writing, and presentation skills through interdisciplinary projects. They will explore subjects through their choice of elective courses in order to develop an understanding of their strengths and interests as they plan for their high school coursework.<br></br>The MS program places a strong emphasis on community building and belonging as students navigate their pre-teen and early teenage years.",
    "sub8": "Click here to view the ",
    "sub9": "<a>Student-Parent Handbook.</a>"
  },
  "HighSchool": {
    "header": "HIGH SCHOOL",
    "title1": "AGES 14-18",
    "sub1": "RISR’s high school (HS) program is designed to prepare students for success in their university, career, and community beyond high school. Our mission is to graduate “successful, balanced, and compassionate individuals.” RISR’s unique STREAM approach combines American, standards-based coursework with a holistic approach to developing the skills students need to thrive in the 21st century: critical thinking, creativity, communication, collaboration, and citizenship skills.<br></br><br></br>Courses and lessons are structured to make sure students are engaged, challenged, and guided to become independent learners. The STREAM approach guarantees that students have a broad range of courses in science and social sciences, technology, recreation, engineering, arts and languages, and math. Throughout, students use an inquiry-based approach to learning that deepens their understanding and skills.<br></br><br></br>RIS students and alumni have had a consistently impressive record of matriculating to the world’s top colleges and universities. RISR’s first Grade 12 class will graduate in the spring of 2026",
    "curriculum": "CIRRICULUM",
    "curriculum-sub": "RISR offers a college-preparatory high school program. Students earn the American high school diploma, with options for advanced coursework of their choice. A 1:1 laptop program and multiple learning platforms empower students to develop and hone the skills they need to pursue educational and professional goals in the future.",
    "sub2": "Students in Grade 9 and Grade 10 build a strong foundation in English, mathematics, science, and social sciences, with elective classes creating cross-curricular learning opportunities. Electives include physical education, drama or fine arts, additional modern languages, Thai, or STEM. In Grade 11 and Grade 12, students continue to build their knowledge and skills by choosing from a selection of courses to meet the requirements for the high school diploma. RISR will over Advanced Placement (AP) courses initially and seek authorization to offer the same choice of diploma pathways as RIS.<br></br><br></br>In combination with its focus on academics, the high school at RISR emphasizes character education and a commitment to the community. The United Nations Sustainable Development Goals are embedded throughout the curriculum to inspire students to think broadly and become leaders to demonstrate “compassion through action” in line with our vision. All high school students will complete an internship or externship experience, community service, and a capstone project to connect their learning to the local community.",
    "title2": "DAILY SCHEDULE",
    "sub3": "Schedules follow a 2-day rotation within the five-day week, starting from A Day on the first day of the school year. Classes are designed to offer collaborative practice as well as target independent learning needs.",
    "title3": "graduation requirements",
    "sub4": "To qualify for an RISR diploma, students must earn at least 28  credits, complete their final year of high school at RIS, and fulfill the following minimum requirements:",
    "sub5": "<b>English</b> – 4.0 (at least one English class per year)",
    "sub6": "<b>Mathematics</b> – 3.0",
    "sub7": "<b>Social Sciences</b> – 2.0",
    "sub8": "<b>Science</b> – 3.0",
    "sub9": "<b>Performing and/or Visual Arts</b> – 2.0",
    "sub10": "<b>Physical Education</b> – 2.0",
    "sub11": "<b>Modern Language</b> – 2.0",
    "sub12": "<b>Thai</b> – 4.0 (Thai citizens)",
    "sub13": "<b>Health</b> – 1.0",
    "sub14": "<b>Tech/STEM</b> – 2.0",
    "sub15": "<b>Electives</b> – 3.0",
    "sub16": " RISR students and families may consult the <a>High School Program of Studies,</a> a detailed guide that includes all of the information needed to plan their four-year high school career. Students are encouraged to share information with parents and to spend time consulting with teachers and the student support team whenever possible about specific classes. The guide helps students make informed choices about their desired courses and academic pathway, as well as prepare for university entrance. Click here to view the <a>Student-Parent Handbook.</a>",
    "title4": "UNIVERSITY ADMISSIONS",
    "sub17": "Graduates from RIS have attended dozens of universities around the world over the last 65 years.<br></br>RIS Ratchapruek focuses on finding the best fit for each child - in terms of country, context, language, and program of study.<br></br>The Student Support, curriculum, and guidance teams work together closely to advise students and families on university entry requirements and planning high school coursework and diploma pathways with the end goal in mind."
  },
  "SchoolWide": {
    "header": "SCHOOLWIDE LEARNER OUTCOME",
    "header1": "Head & knowledge",
    "title1": "Creative",
    "desc1": "They are intrinsically motivated and independent.  When they are interested in a task or creation, they take ownership of their creativity and complete tasks with confidence.  They also think deeply about whatever they are working on and come up with new levels of depth for traditional topics.<br></br><br></br>They are full of creativity and like to do things in their own special way. When they find something they're excited about creating, they take charge of their ideas and finish their projects feeling proud of what they've made. They also think deeply about their creative projects and come up with new and exciting ideas about things that are usually well-known.",
    "title2": "CRITICAL THINKERS",
    "desc2": "They improve the quality of their learning by using acquired knowledge to analyze, assess and reconstruct their ideas.  They question their own processes, are aware of personal strengths and weaknesses, organize their thoughts and evaluate personal success.  They are drivers of their own learning and often push their learning beyond what is presented to them.<br></br><br></br>They improve their learning by using what they've learned to think carefully, figure things out, and put their ideas together in new ways. They ask themselves questions about how they're doing things, know what they're good at and where they might need help, organize their thoughts, and think about how well they're doing. They want to feel like they are in charge of their own learning and they often try to learn even more than what they're taught.",
    "title3": "OPEN-MINDED",
    "desc3": "They understand and appreciate their own cultures and beliefs, and they are open to perspectives, values and traditions of other individuals and communities.  They keep an open mind to understand other points of view, learn from other perspectives, use this knowledge as an opportunity to grow and resolve conflict. <br></br><br></br>They want to know about other people and accept them for who they are and what they believe in. They also like to learn about how other people see things, what they think is important, and how they do things. They're good at listening to different ideas, learning from what other people think, and using this knowledge to become even better. They also use what they learn to help solve problems and disagreements.",
    "header2": "HANDS & SKILLS",
    "title4": "EFFECTIVE COMMUNICATORS",
    "desc4": "They are able to form ideas and information in a clear and logical way.  They can then express these ideas through a variety of ways dependent upon the receiver.  They understand that communication requires both delivering and receiving information.<br></br><br></br>They are good at putting their thoughts and information together in a way that people can understand clearly. They can share their thoughts in different ways, depending on who they're talking to. They know that communication is about not just talking, but also listening and understanding what others say.",
    "title5": "COLLABORATIVE",
    "desc5": "They work alongside others with the goal of learning or creating something new.  They understand that multiple perspectives bring depth to a learning experience and value diverse input.  They understand team processes and see value in collective experiences.  They understand that others have necessary skills for expanding a learning experience.<br></br><br></br>They like to team up with others to learn or make new things together. They know that when a lot of people share their ideas, it makes learning even more interesting. They think it is important to listen to what different people have to say. They also know how teams work and think it's good to do things together. They understand that everyone has something important to add to the learning experience.",
    "title6": "RESOURCEFUL",
    "desc6": "They possess a growth mindset and resiliency that allow them to find and use available resources to solve problems and achieve goals.  They are able to envision the path for achieving goals and identify the necessary steps for achieving them.  They think systematically to assure success regardless of which resources are available.<br></br><br></br>They have a special way of thinking that helps them find and use things around them to fix problems and reach their goals. They can see the way to get things done and know what they need to do step by step. They are good at thinking in an organized way to make sure they succeed, no matter what they have to work with.",
    "title7": "EMBRACE DIVERSITY",
    "desc7": "They understand that each individual is unique and offers their own perspectives.  They go beyond tolerance and shift into celebrating the differences that each member of the community possesses.  They respect these differences and use them to shape their own perspectives.<br></br><br></br>They know that everyone is different and they have their own way of seeing things. They don't just accept these differences – they enjoy them and think they make the group better. They treat these differences with kindness and use them to help them see the world in new ways.",
    "title8": "LEAD HAPPY & HEALTHY LIVES",
    "desc8": "They understand that their own actions impact the quality of their life.  They assess situations to help make the right choices.  They understand how intellectual, emotional and physical well being play a part in creating a balanced lifestyle.<br></br><br></br>They know that what they do affects how good they feel. They look at things carefully to make good decisions. They also know that taking care of their mind, heart, and body helps them live a good and balanced life.",
    "title9": "HELP OTHERS",
    "desc9": "They understand that they are individuals and agents of change within a greater community and work to achieve success for the greater whole.  They know that sometimes they must put others before themselves for the common good.   They seek opportunities to assist and guide others toward success with empathy and kindness.<br></br><br></br>They know they're part of a bigger group and try to make things better for everyone. They understand that sometimes it's important to help others even if it means not thinking only about themselves. They look for chances to help and show others the way to do well.",
    "header3": "HEART & VALUES"
  },
  "Contact": {
    "header": "CONTACT",
    "address": "Address",
    "address-sub1": "Ruamrudee International School Ratchapruek Campus<br></br>999 Moo 4 Bang Kruai-Sai Noi Road, Bang Krang<br></br>Nonthaburi, Nonthaburi 11000 Thailand",
    "address-sub2": "โรงเรียนร่วมฤดีวิเทศศึกษา ราชพฤกษ์ แคมปัส<br></br>999 หมู่ 4 ถนนบางกรวย–ไทรน้อย<br></br>ตำบล บางกร่าง อำเภอ เมืองนนทบุรี จังหวัด นนทบุรี 11000 ",
    "phone": "PHONE",
    "phone-sub": "Telephone: <b>+66 (0)2 030 0533</b>",
    "contact-form": "CONTACT FORM",
    "name": "Name ",
    "email": "Email",
    "telephone": "Telephone",
    "subject": "Subject",
    "comment": "Comment",
    "select1": "General Inquiries",
    "select2": "Admissions",
    "select3": "Employment",
    "select4": "Others",
    "submit": "Submit"
  },
  "Calendar": {
    "header": "School Calendar"
  },
  "PersonalData": {
    "header": "PERSONAL DATA POLICY"
  },
  "WorkAtRisr": {
    "header": "WORK AT RISR",
    "title1": "WORK AT RISR",
    "sub1": "RIS Ratchapruek teachers and administrators are dedicated educators who are committed to the moral purpose of our school: to provide a top-quality education while fostering character development in students of all faiths and helping them to realize their highest potential. Within our positive learning environment, RIS faculty guide students to become ethical, principled individuals. Teachers and administrators are valued stakeholders who contribute their time, energy, and talent to foster the vision and core beliefs of the school community, to the benefit of the entire school.",
    "sub2": "RIS Ratchapruek teachers and faculty are expected to be",
    "sub3": "collaborative team members",
    "sub4": "knowledgeable and up to date in their content area/field of expertise",
    "sub5": "technologically literate",
    "sub6": "competent using a variety of strategies to meet curricular outcomes",
    "sub7": "able to accommodate different learning styles and abilities",
    "sub8": "Ongoing professional development related to teaching and learning—and sharing what is learned with colleagues—is an integral part of working RIS Ratchapruek. Teachers receive an annual professional development allowance and a monthly professional growth stipend to further their education, develop new skills, and continue to learn about developments in best practices in teaching and learning.",
    "sub9": "Candidates for teaching positions at RIS Ratchapruek are expected to have at least a bachelor’s degree and current in-field certification. Two years of experience or more in a K–12 school is preferred. New teachers recruited at overseas job fairs are asked to sign an initial 2-year contract, which can be extended after that on a yearly basis. One-year or single-semester contracts are occasionally offered when hiring locally or for short-term replacements. All contracts are reviewed when a term of employment ends.",
    "sub10": "Ruamrudee International School Ratchapruek Campus offers a competitive salary and benefits package including a professional growth fund, local group health insurance, settling-in allowance, incoming and outgoing flights, annual home leave allowance for employees, and a signing bonus for overseas recruits who enter a 2-year full-time teaching contract.",
    "sub11": "RISR is a Child Safeguarding School. All employees are required to complete rigorous background checks and abide by our school’s Child Safeguarding policies. Rigorous background checks and paper copies of qualifications will be required to meet visa requirements for teachers in the Kingdom of Thailand.",
    "title2": "Our Commitment to Child Safeguarding",
    "sub12": "RIS Ratchapruek's Child Safeguarding Committee consists of our Principal and Director of Academics, our Assistant Head of School, and our School Psychologist.<br></br>All candidates for employment are subject to rigorous background and reference checks per Thailand's Child Protection Act of 2014. All school faculty, staff, contractors, and coaches engage in annual child safeguarding training and professional development.",
    "sub13": "Interested candidates are requested to submit the following:",
    "sub14": "• Resume or CV",
    "sub15": "• A copy of credential and diploma",
    "sub16": "• Link to blog or professional website, if applicable",
    "sub17": "• Name and contact information of at least two references",
    "sub18": "• Please indicate if you are a candidate on GRC, Search, or ISS",
    "sub19": "* All documents should be combined into a single PDF file and emailed to recruitment2024@risr.ac.th.",
    "title3": "SCHOOL YEAR 2024-2025",
    "sub20": "Interested candidates are requested to submit the following:<br></br>Resume or CV<br></br>A copy of credential and diploma<br></br>Link to blog or professional website, if applicable<br></br>Name and contact information of at least two references<br></br>Please indicate if you are a candidate on GRC, Search, or ISS<br></br>* All documents should be combined into a single PDF file and emailed to recruitment2024@risr.ac.th. *"
  }
}
