{
  "Navbar": {
    "apply": "Apply Now",
    "book-tour": "Book a Tour",
    "school-map": "School Map",
    "contact-us": "Contact Us",
    "news": "News",
    "school-calendar": "School Calendar",
    "work-risr": "Work at RISR",
    "portals": "Portals"
  },
  "Footer": {
    "school-name": "Ruamrudee International school<br></br>Ratchapruek campus",
    "tel": "+66 (0)2 030 0533",
    "address": "Bang Kruai - Sai Noi Rd, Tambon Bang Krang,<br></br> Amphoe Mueang Nonthaburi, Chang Wat<br></br> Nonthaburi 11000",
    "admissions": "admissions",
    "tuition": "Tuition & Fees",
    "apply": "How to Apply",
    "book": "Book a Tour",
    "scholarships": "Scholarships",
    "about": "About RISR",
    "overview": "Overview",
    "history": "History",
    "vision": "Vision & Mission",
    "curriculum": "Curriculum",
    "facilities": "Facilities",
    "leadership": "Leadership Team",
    "academics": "academics",
    "pre-kindergarten": "Pre-Kindergarten",
    "elementary-school": "Elementary School",
    "middle-school": "Middle School",
    "hight-school": "Hight School",
    "community": "community",
    "ris-minburi": "RIS Minburi Campus",
    "ris-early": "RIS Early Years Campus",
    "ris-phuket": "RIS Phuket Campus",
    "work": "Work at RISR",
    "personal-data-policy": "Personal Data Policy",
    "copyright": " 2024 Ruamrudee International School Ratchapruek campus"
  },
  "School-map": {
    "facilities": "FACILITIES",
    "facilities-details": "RIS Ratchapruek is located in Bang Kruai, Nonthaburi. Our purpose-built campus is located near Ratchapruek Road, about 20 kilometers north of Bangkok and west of the Chao Praya River. Separate buildings for each section, dedicated classrooms, community space, indoor and outdoor playgrounds, a soft-play motor room, and swimming pool for Middle and High School, as well as a swimming pool designed for our youngest learners, students ages 2-5 are given a gentle introduction to school in a warm and caring environment.<br></br><br></br>Our secondary building is currently being constructed. The secondary building will house our middle school and high school programs.",
    "school-map": "SCHOOL MAP"
  },
  "Home": {
    "school-name": "RUAMRUDEE INTERNATIONAL SCHOOL<br></br>RATCHAPRUEK CAMPUS",
    "news": "NEWS",
    "ris-history": "RIS HISTORY"
  },
  "Tuition": {
    "title": "TUITION & FEES",
    "click-below": "Click below to view a link or download a PDF:",
    "content": "Tuition & Fees 2022–2023"
  },
  "Scholarship": {
    "title": "SCHOLARSHIPS",
    "scholarship": "SCHOLARSHIP",
    "content": "RISR offers scholarships that support the school's mission while recognizing student achievement — excellence in and out of the classroom and demonstrated leadership. The school awards a variety of scholarships on a competitive basis to incoming and current to exceptional students each year. We also provide need-based financial assistance to qualified families. For more information, please contact the the RISR Admissions Office at: ",
    "email": "admissions@risr.ac.th"
  },
  "Curriculum": {
    "title": "CURRICULUM",
    "curriculum-content": "RIS follows the American curriculum, which is standards-based. Standards are skills and concept knowledge aligned for the stage of development that corresponds to each grade level.<br></br><br></br>From one grade level to another, students build a progression of standards that deepens their understanding of each content area and enhances their skills. Teachers are highly skilled in using ongoing assessments to understand what concepts and skills students have mastered and what they are ready to learn next. This ensures a rigorous approach for students through differentiation.<br></br><br></br>Standards include the Washington, D.C. Early Childhood Standards and American Education Reaches Out (AERO) standards for our core subject areas of English language, mathematics, and social studies, Next Generation Science Standards (NGSS) for science and ISTE for integrated technology, and standards specific to specialist subjects."
  }
}