{
  "Navbar": {
    "apply": "Apply Now",
    "book-tour": "Book a Tour",
    "school-map": "School Map",
    "contact-us": "Contact Us",
    "news": "News",
    "school-calendar": "School Calendar",
    "work-risr": "Work at RISR",
    "portals": "Portals"
  },
  "Footer": {
    "school-name": "Ruamrudee International school<br></br>Ratchapruek campus",
    "tel": "+66 (0)2 030 0533",
    "address": "Bang Kruai - Sai Noi Rd, Tambon Bang Krang,<br></br> Amphoe Mueang Nonthaburi, Chang Wat<br></br> Nonthaburi 11000",
    "admissions": "admissions",
    "tuition": "Tuition & Fees",
    "apply": "How to Apply",
    "book": "Book a Tour",
    "scholarships": "Scholarships",
    "about": "About RISR",
    "overview": "Overview",
    "history": "History",
    "vision": "Vision & Mission",
    "curriculum": "Curriculum",
    "facilities": "Facilities",
    "leadership": "Leadership Team",
    "academics": "academics",
    "pre-kindergarten": "Pre-Kindergarten",
    "elementary-school": "Elementary School",
    "middle-school": "Middle School",
    "hight-school": "Hight School",
    "community": "community",
    "ris-minburi": "RIS Minburi Campus",
    "ris-early": "RIS Early Years Campus",
    "ris-phuket": "RIS Phuket Campus",
    "work": "Work at RISR",
    "personal-data-policy": "Personal Data Policy",
    "copyright": " 2024 Ruamrudee International School Ratchapruek campus"
  },
  "School-map": {
    "facilities": "FACILITIES",
    "facilities-details": "RIS Ratchapruek is located in Bang Kruai, Nonthaburi. Our purpose-built campus is located near Ratchapruek Road, about 20 kilometers north of Bangkok and west of the Chao Praya River. Separate buildings for each section, dedicated classrooms, community space, indoor and outdoor playgrounds, a soft-play motor room, and swimming pool for Middle and High School, as well as a swimming pool designed for our youngest learners, students ages 2-5 are given a gentle introduction to school in a warm and caring environment.<br></br><br></br>Our secondary building is currently being constructed. The secondary building will house our middle school and high school programs.",
    "school-map": "SCHOOL MAP"
  },
  "Home": {
    "school-name": "RUAMRUDEE INTERNATIONAL SCHOOL<br></br>RATCHAPRUEK CAMPUS",
    "news": "NEWS",
    "ris-history": "RIS HISTORY",
    "view-all-news": "View all news"
  },
  "Tuition": {
    "title": "TUITION & FEES",
    "click-below": "Click below to view a link or download a PDF:",
    "content": "Tuition & Fees 2022–2023"
  },
  "Scholarship": {
    "title": "SCHOLARSHIPS",
    "scholarship": "SCHOLARSHIP",
    "content": "RISR offers scholarships that support the school's mission while recognizing student achievement — excellence in and out of the classroom and demonstrated leadership. The school awards a variety of scholarships on a competitive basis to incoming and current to exceptional students each year. We also provide need-based financial assistance to qualified families. For more information, please contact the the RISR Admissions Office at:  ",
    "email": "admissions@risr.ac.th"
  },
  "Curriculum": {
    "title": "CURRICULUM",
    "curriculum-content": "RIS follows the American curriculum, which is standards-based. Standards are skills and concept knowledge aligned for the stage of development that corresponds to each grade level.<br></br><br></br>From one grade level to another, students build a progression of standards that deepens their understanding of each content area and enhances their skills. Teachers are highly skilled in using ongoing assessments to understand what concepts and skills students have mastered and what they are ready to learn next. This ensures a rigorous approach for students through differentiation.<br></br><br></br>Standards include the Washington, D.C. Early Childhood Standards and American Education Reaches Out (AERO) standards for our core subject areas of English language, mathematics, and social studies, Next Generation Science Standards (NGSS) for science and ISTE for integrated technology, and standards specific to specialist subjects."
  },
  "Extended": {
    "title": "EXTENDED DAY PROGRAM",
    "edps": "EDPs 2023-2024SESSION 2",
    "regis-form": "Registation form",
    "room-allocation": "Room allocation session 2",
    "edp-policy": "EDP Policy",
    "all-courses": "ALL COURSES",
    "all-courses-sub1": "All courses are 3:00 to 4:00 p.m.<br></br>unless stated otherwise.<br></br><br></br>Suggested grade levels listed below may be slightly flexible.<br></br><br></br>Click the dropdown for more course information.<br></br><br></br>For more info: EDP ",
    "all-courses-sub2": "email: <b>edp@rism.ac.th</b>",
    "all-courses-sub3": "Course details may be subject to change. ",
    "ris-extended": "RIS Extended Day Program Policy",
    "sub1": "The Extended Day Program at Ruamrudee International School strives to provide a welcoming, fun, and safe learning environment for students. Courses are designed to challenge, excite, and intrigue children through a variety of different educational fields, including Science, Technology, Mathematics, Sports, and the Arts. Courses are sponsored (taught) by academic professionals from both Ruamrudee International School faculty and outsourced vendors.",
    "sub2": "Each year, we offer three EDP sessions of 8 weeks per session (unless otherwise stated). For the current academic year, RIS has put the following policies into practice to ensure a safe, fair, and well-managed program for our local community."
  },
  "Overview": {
    "title": "OVERVIEW",
    "established": "ESTABLISHED",
    "established-sub": "1957",
    "website": "WEBSITE",
    "website-sub": "WEBSITE",
    "address": "ADDRESS",
    "address-sub": "Ruamrudee International School Ratchapruek Campus<br></br>999 Moo 4 Bang Kruai-Sai Noi Road, Bang Krang<br></br>Nonthaburi, Nonthaburi 11000 Thailand",
    "email": "EMAIL",
    "email-sub1": "<b>info@rism.ac.th</b>",
    "email-sub2": "<b>admissions@rism.ac.th</b>",
    "phone": "PHONE",
    "phone-sub": "+66 (0)2 791 8900",
    "curriculum": "CURRICULUM",
    "curriculum-sub": "RIS offers a modified American curriculum. Pre-K follows a learning and development continuum based on the Reggio Emilia approach to learning. Core subjects from Kindergarten to Middle School are aligned with the American Education Reaches Out (AERO) standards. High school students can choose between the International Baccalaureate (IB) Diploma Program and the Advanced Placement (AP) program.",
    "accreditation": "ACCREDITATION",
    "accreditation-sub": "WASC (Western Association of Schools and Colleges), Thai Ministry of Education",
    "affiliations": "AFFILIATIONS",
    "affiliations-sub": "Redemptorists of Thailand, International Baccalaureate (IB), CollegeBoard (AP), EARCOS (East Asia Regional Council of Overseas Schools), CIS (Council of International Schools), ISAT (International Schools Association of Thailand), ONESQA (Office for National Education Standards and Quality Assessment)",
    "enrollment": "ENROLLMENT",
    "enrollment-sub": "1,100 students",
    "ages": "AGES",
    "ages-sub": "3 (Pre-K 3) to 18 (Grade 12)",
    "ratio-teaching": "RATIO OF TEACHING STAFF TO STUDENTS",
    "ratio-teaching-sub1": "Pre-K – Kindergarten: 18 students / class (1 teacher, instructional aide & nanny)",
    "ratio-teaching-sub2": "Grades 1–5: 22 students / class (1 teacher & instructional aid)",
    "ratio-teaching-sub3": "Grades 6–12: 22 students / class (multiple subject specialist teachers)",
    "fees": "FEES",
    "fees-sub": "400,000 baht per year (Pre-K) to 700,000 baht per year (Grade 12), not including registration, campus development, and other fees. ",
    "other-campuses": "Other campuses",
    "other-campuses-sub": "Ruamrudee International School Early Years Campus (Phraya Suren Road, Ramintra-Kanchanapisek area) and Ruamrudee International School Ratchapruek Campus (Bang Kruai-Sai Noi Road, Bang Krang, Nonthaburi)"
  },
  "Vision": {
    "title": "VISION & MISSON",
    "vision": "VISION",
    "vision-sub": "Ruamrudee International School will be known globally as a hallmark of international education, and physical well-being, while fostering compassion through action and shaping the lives of tomorrow's leaders.",
    "mission": "MISSION",
    "mission-sub": "Ruamrudee International School is a Catholic school that provides an interfaith, inclusive, and academically rigorous education for students to be balanced, successful, and compassionate individuals.",
    "ris-sub": "The school seal portrays a globe with the initials RIS below it. The lines of longitude represent the international nature of the school. The impression of a church with a flag atop its roof signifies the Christian spirit of family love that has always characterized the school community, preparing RIS students to be good and responsible citizens of the world.<br></br><br></br>The school motto is engraved in the RIS Senior pin, which is shaped like a shield and bears the Latin words Ad Astra above the symbol of a cross and five stars. Translated “to the stars,” Ad Astra encourages every student to aim for the best, not only in their education but also in their personal and spiritual growth. <br></br><br></br>The school colors are white and blue with a splash of red. As in the Thai National flag, these colors exemplify loyalty and patriotism with school spirit and moral inspiration.",
    "sub2": "Together with the senior gown, the pin is presented at the traditional Senior Convocation held at the beginning of each academic year, to impress upon each student the responsibilities that come along with the privileges of being a senior.",
    "sub3": "The school’s sports mascot is “The Phoenix,” a symbol of strength and excellence. In Egyptian mythology, the phoenix is a beautiful bird that consumes itself by fire every 500 years to rise anew from its ashes. ",
    "studen-learner": "STUDENT LEARNER OUTCOMES(PRINCIPLES OF PHOENIX)"
  },
  "Leadership": {
    "title": "Leadership Team",
    "title1": "A MESSAGE FROM THE SCHOOL DIRECTOR",
    "sub1": "The RIS motto Ad Astra means ‘to the stars.’ While we certainly encourage our students to reach for the stars academically, we also take pride in the personal and spiritual growth of our students… For over six decades, RIS has fostered amazing students and alumni. I am honored to be here and be part of its legacy.<br></br><br></br>Rev. Fr. Jittapol Plangklang, C.Ss.R.<br></br>School Director",
    "title-camp1": "M.S.Ed. (School & Mental Health Counseling)",
    "sub-camp1": "University of Pennsylvania",
    "title-camp2": "M.A. (Spirituality)",
    "sub-camp2": "Fordham University, New York",
    "title-camp3": "M.A.T. (Religious Education)",
    "sub-camp3": "Ateneo de Davao University, Philippines",
    "title-camp4": "B.A. (Philosophy & Religion)",
    "sub-camp4": "Saengtham College, Thailand",
    "title-camp5": "Certificate in Advanced Education Leadership",
    "sub-camp5": "(Harvard University, Cambridge)",
    "title-camp6": "Certificate in School Management & Leadership",
    "sub-camp6": "(Harvard University, Cambridge)",
    "title-camp7": "Mental Health Specialist Certificate",
    "sub-camp7": "(American School Counselor Association)",
    "title-camp8": "School Counseling Data Specialist Certificate",
    "sub-camp8": "(American School Counselor Association)",
    "title2": "A MESSAGE FROM THE HEAD OF SCHOOL",
    "sub2": "At RIS, we live by the Principles of the Phoenix (PoPs): Head (knowledge) through our students’ academic talents… Hands (skills) through the never-ending opportunities for our students to take part in athletics, activities, and our extended day programs… Heart (values) through all the service-oriented club activities and countless other ways our students choose to give back to the community. There is truly an ideal track for just about every student at RIS, and I could not be more proud to be part of it! <br></br><br></br>Dr. Jim O’Malley<br></br>Head of School / High School Principal",
    "title3": "A MESSAGE FROM The SENIOR ADVISOR TO THE RIS LEADERSHIP TEAM",
    "sub3": "RIS has a long and successful history of providing strong academic programs integrated within a moral and ethical framework. We inspire our students to aim at excellence, and while any school can build leaders, I believe RIS builds great leaders. In the spirit and the meaning of Ruamrudee, Union of Hearts, we work together to nurture intellectual development, foster compassion, and shape the lives of tomorrow’s leaders. <br></br><br></br>Rev. Fr. Apisit Kritsaralam, C.Ss.R.<br></br>Senior Advisor to the RIS Leadership Team ",
    "title-camp9": "Ed.D. (Educational Leadership & Policy)",
    "sub-camp9": "Florida State University",
    "title-camp10": "M.S. (Educational Leadership)",
    "sub-camp10": "University of Central Florida",
    "title-camp11": "B.A. (Physical Education)",
    "sub-camp11": "Florida State University",
    "title-camp12": "Graduate Certificate in Program Evaluation",
    "sub-camp12": "(Florida State University)",
    "title-camp13": "M.Ed. (Counseling)",
    "sub-camp13": "Loyola University, Chicago",
    "title-camp14": "M.A. (Spirituality)",
    "sub-camp14": "Fordham University, New York",
    "title-camp15": "B.A. (Theology)",
    "sub-camp15": "Saengtham College, Thailand",
    "title-camp16": "B.A. (Philosophy & Religion)",
    "sub-camp16": "Saengtham College, Thailand",
    "title-camp17": "Certificate of Advanced Studies in Educational Sciences",
    "sub-camp17": "(Catholic University of Leuven)"
  },
  "Elementary": {
    "title": "ELEMENTARY SCHOOL",
    "title1": "ages 5-10",
    "sub1": "Elementary School includes our students in Kindergarten to Grade 5. RIS provides a rigorous academic program that integrates students’ social and emotional development. All of our elementary school teachers are highly qualified and certified within their specific subject areas.<br></br><br></br>Many of our teachers have additional certifications in reading, language development, and learning support. But that is not what makes our Elementary program such a special place; it is the warm, caring environment that facilitates learning and builds character, preparing our students for middle school, high school, college, and life. We take pride in nurturing the student-centered learning environment we provide for our children.",
    "curriculum": "CIRRICULUM",
    "curriculum-sub": "Core subjects are based on the American Education Reaches Out (AERO) standards and taught by the grade-level classroom teachers. We integrate the Fountas and Pinnell Literacy Continuum within a Readers and Writers Workshop to provide a balanced literacy model, and science and math are inquiry-based courses with a focus on critical thinking—all skills that are vital for success in the future. Across all grades, students have access to devices and lessons about the proper use of technology so teachers and students can safely use digital tools and resources in innovative and creative ways. In Kindergarten through grade 2, each student has access to an iPad, and in grades 3–5, RIS has a 1:1 Chromebook program.",
    "sub2": "Beyond the core subjects of math, reading, writing, science, and social studies, your child will have daily opportunities to experience and explore other interests and talents in their specialist subjects—art, music, physical education, a second language, and values. Our students are also introduced to skills and concepts in health and wellness. All elementary students are required to take Thai language and literacy, and our non-Thai students also learn about Thai culture. Collectively, these subjects not only offer elementary students a well-rounded school experience, but they help our children learn how to be considerate global citizens who are aware of the importance of caring about other people and our environment.<br></br><br></br>Our students’ social and emotional well-being is further supported by the Second Step curriculum. All of our teachers are skilled at adapting learning to individual student’s needs and meeting them where they are, developmentally. In all grades, we encourage students to make appropriate choices and exercise their independence, which promotes autonomy and a sense of safety—all of which are essential in developing well-adjusted, happy children who can focus on their learning.<br></br><br></br>The English Language Development Program (ELD) recognizes that one of the top priorities in a quality international education is the attainment of an academic-level of English fluency. English language learners are designated by their level of proficiency, from beginner to advanced, and each level requires matched instructional strategies to facilitate rapid skill development.<br></br><br></br>At RIS Ratchapruek, ELD students are immersed in a rich English-speaking environment and selectively enrolled in core mainstream subjects to give them frequent opportunities to interact with classmates and teachers. ELD students also get individualized support to accelerate their academic success.",
    "sub3": "Small-group pull-out and language support classes provide specialized learning time where content instruction and the development of English skills are closely integrated. Push-in support gives English language learners help within mainstream classes.<br></br><br></br>RISR uses MAP NWEA and WIDA MODEL assessments to track progress in English language and academic skill development throughout the year, informing differentiation that supports each child's unique needs.",
    "sub4": "Click here to view the <a>Student-Parent Handbook.</a>"
  },
  "History": {
    "header": "HISTORY",
    "title1": "OVER 60 YEARS OF EXCELLENCE IN EDUCATION",
    "sub1": "In 1957, the Redemptorists of Thailand formed the idea for a school to meet the educational and catechetical needs of children of expatriate and local Catholic parishioners. A makeshift school officially opened on May 17 of that year—designated RIS Foundation Day—with four wooden classrooms behind Holy Redeemer Church. In 1963, what was then known as Ruam Rudi School (RRS) was officially chartered under the Thai Ministry of Foreign Affairs and renamed Ruamrudee International School (RIS). ",
    "sub2": "May 17, 1957, is the designated Foundation Day of RIS. This photo, dated November 1965, was when new buildings were completed and blessed in an official school opening ceremony. What was then known as Ruam Rudi School (RRS) was later officially renamed Ruamrudee International School (RIS).",
    "sub3": "“Ruamrudee,” Thai for “union of hearts,” perfectly encapsulates the RIS philosophy of welcoming all children, emphasizing social responsibility, and ensuring a warm learning environment. RIS became one of the first schools in Asia to be fully accredited by WASC (the Western Association of Schools and Colleges) and the Thai Ministry of Education, and in 1992, moved from its original Soi Ruamrudee campus in downtown Bangkok to its current location in Minburi. An IB World School since 1998, RIS is one of few schools in Thailand to offer both the International Baccalaureate Diploma Program and Advanced Placement tracks. ",
    "sub4": "Ruamrudee International School, founded in 1957, was originally located in Soi Ruamrudee 5 in downtown Bangkok.",
    "sub5": "RIS students consistently prove their academic excellence by scoring far above world averages and attending the most prestigious colleges and universities around the world. RIS students benefit from small class sizes, relevant and innovative electives, modern languages, and a vibrant performing and visual arts program. The Student Services department, led by a school psychologist, ensures that the English Language Development and Learning Support programs meet the diverse needs of all students. ",
    "sub6": "Fr. Thomas Griffith, founder of the RIS Minburi campus, surveys the new RIS admin building with Fr. Leo Travis & Fr. Patrick Morrissey in the early 90s.",
    "sub7": "RIS Ratchapruek opened in August 2019 in Bang Kruai, Nonthaburi. Our purpose-built campus is near Ratchapruek Road and approximately 20 kilometers north of Bangkok and west of the Chao Praya River.<br></br><br></br>Our Secondary Building is currently under construction. The Secondary Building will be the home of our middle school and high school programs.",
    "our-campus": "OUR CAMPUS",
    "sub8": "RIS Ratchapruek"
  },
  "PreK": {
    "header": "Pre-Kindergarten",
    "title1": "AGES 2-5",
    "sub1": "At the RIS Ratchapruek Campus, Pre-K students learn in their own pod. With dedicated classrooms, community space, indoor and outdoor playgrounds, a soft-play motor room, and even a swimming pool designed for our youngest learners, students ages 2–5 receive a gentle introduction to school in a warm and caring environment.<br></br><br></br>At the RIS Ratchapruek Campus, Pre-K students learn in their own pod. With dedicated classrooms, community space, indoor and outdoor playgrounds, a soft-play motor room, and even a swimming pool designed for our youngest learners, students ages 2–5 receive a gentle introduction to school in a warm and caring environment.",
    "curriculum": "CIRRICULUM",
    "curriculum-sub": "The Early Childhood program at RIS Ratchapruek reflects the Reggio Emilia approach in its belief that all children have an interest in constructing their own knowledge and that they interact with everything the environment brings to them. Our teachers follow the children’s interests to shape the units of inquiry. Each group of students is unique, with unique interests, and so while the units may vary from year to year, it follows a learning and development continuum based on Early Childhood standards.<br></br><br></br>Our Pre-K curriculum is based on the District of Columbia’s Common Core Early Learning Standards that define what preschool children should know and be able to do before they enter kindergarten. These Early Learning standards direct teachers’ instructional planning through developmentally appropriate guidelines that meet our children at their current developmental stage.<br></br><br></br>Early Childhood is a very specialized area within education, requiring very special teachers. All of our Pre-K teachers are certified and trained in Early Childhood education. Each grade level (Pre-K 2, 3, and 4) has a certified Early Childhood Special Educator on its team, as well as Instructional Assistants, nannies, and a dedicated janitorial and canteen team.",
    "sub2": "Lessons include literacy, math, and social and emotional topics that might come up in their young lives. Lessons are presented through hands-on demonstrations, purposeful visuals, and lots of singing. Students then choose and rotate through interest centers—role-play, writing, science exploration, light and shadows, and construction, to name a few. Our Pre-K children also attend specialist classes throughout the week including music, art, computers, library, physical education, and Thai. Students have a healthy snack in the morning and eat lunch in our separate canteen purposely built for our youngest students. The day ends with nap time in the classroom and an afternoon snack before returning home.",
    "sub3": "Click here to view the <b>Student-Parent Handbook.</b>"
  },
  "MiddleSchool": {
    "header": "MIDDLE SCHOOL",
    "title1": "AGES 11-13",
    "sub1": "The Middle School program is designed to increase cohort learning experiences across skill and grade levels. Cohort learning is proven to:",
    "sub2": "improve academic performance due to enhanced feelings of support and connection",
    "sub3": "increase exposure to diverse ideas and perspectives",
    "sub4": "give the support and motivation needed to strive and reach for higher expectations",
    "sub5": "provide experience relative to real world group and interpersonal skills",
    "sub6": "increase learners' abilities to generalize and transfer experiences into further environments",
    "curriculum": "CIRRICULUM",
    "curriculum-sub": "Benefits of cohort learning included skill development in the following areas:<br></br>Collaboration: With facilitation on social interaction and collaboration with peers, cohort learning enhances learning experiences and overall sense of community Continuation of Learning: As students advance through learning experiences, cohort learning allows for teachers to individually structure the learning needs to each individual. Group abilities provide continued support as skill progression advances.<br></br>Support: Cohort learning connects learners with the support of their peers and teachers. Active engagement and encouragement extend learning opportunities<br></br>Perspective: Cohort learning expands learners’ perspectives. As engagement with others increases, students are exposed to new choices, opinions, experiences and ideas.",
    "title2": "MIDDLE SCHOOL COURSES",
    "sub7": "Students will have both compulsory and elective courses in middle school. Compulsory classes include humanities, math, and science.<br></br>Middle school students will solidify their research, writing, and presentation skills through interdisciplinary projects. They will explore subjects through their choice of elective courses in order to develop an understanding of their strengths and interests as they plan for their high school coursework.<br></br>The MS program places a strong emphasis on community building and belonging as students navigate their pre-teen and early teenage years.",
    "sub8": "Click here to view the ",
    "sub9": "<a>Student-Parent Handbook.</a>"
  },
  "HighSchool": {
    "header": "HIGH SCHOOL",
    "title1": "AGES 14-18",
    "sub1": "RISR’s high school (HS) program is designed to prepare students for success in their university, career, and community beyond high school. Our mission is to graduate “successful, balanced, and compassionate individuals.” RISR’s unique STREAM approach combines American, standards-based coursework with a holistic approach to developing the skills students need to thrive in the 21st century: critical thinking, creativity, communication, collaboration, and citizenship skills.<br></br><br></br>Courses and lessons are structured to make sure students are engaged, challenged, and guided to become independent learners. The STREAM approach guarantees that students have a broad range of courses in science and social sciences, technology, recreation, engineering, arts and languages, and math. Throughout, students use an inquiry-based approach to learning that deepens their understanding and skills.<br></br><br></br>RIS students and alumni have had a consistently impressive record of matriculating to the world’s top colleges and universities. RISR’s first Grade 12 class will graduate in the spring of 2026",
    "curriculum": "CIRRICULUM",
    "curriculum-sub": "RISR offers a college-preparatory high school program. Students earn the American high school diploma, with options for advanced coursework of their choice. A 1:1 laptop program and multiple learning platforms empower students to develop and hone the skills they need to pursue educational and professional goals in the future.",
    "sub2": "Students in Grade 9 and Grade 10 build a strong foundation in English, mathematics, science, and social sciences, with elective classes creating cross-curricular learning opportunities. Electives include physical education, drama or fine arts, additional modern languages, Thai, or STEM. In Grade 11 and Grade 12, students continue to build their knowledge and skills by choosing from a selection of courses to meet the requirements for the high school diploma. RISR will over Advanced Placement (AP) courses initially and seek authorization to offer the same choice of diploma pathways as RIS.<br></br><br></br>In combination with its focus on academics, the high school at RISR emphasizes character education and a commitment to the community. The United Nations Sustainable Development Goals are embedded throughout the curriculum to inspire students to think broadly and become leaders to demonstrate “compassion through action” in line with our vision. All high school students will complete an internship or externship experience, community service, and a capstone project to connect their learning to the local community.",
    "title2": "DAILY SCHEDULE",
    "sub3": "Schedules follow a 2-day rotation within the five-day week, starting from A Day on the first day of the school year. Classes are designed to offer collaborative practice as well as target independent learning needs.",
    "title3": "graduation requirements",
    "sub4": "To qualify for an RISR diploma, students must earn at least 28  credits, complete their final year of high school at RIS, and fulfill the following minimum requirements:",
    "sub5": "<b>English</b> – 4.0 (at least one English class per year)",
    "sub6": "<b>Mathematics</b> – 3.0",
    "sub7": "<b>Social Sciences</b> – 2.0",
    "sub8": "<b>Science</b> – 3.0",
    "sub9": "<b>Performing and/or Visual Arts</b> – 2.0",
    "sub10": "<b>Physical Education</b> – 2.0",
    "sub11": "<b>Modern Language</b> – 2.0",
    "sub12": "<b>Thai</b> – 4.0 (Thai citizens)",
    "sub13": "<b>Health</b> – 1.0",
    "sub14": "<b>Tech/STEM</b> – 2.0",
    "sub15": "<b>Electives</b> – 3.0",
    "sub16": " RISR students and families may consult the <a>High School Program of Studies,</a> a detailed guide that includes all of the information needed to plan their four-year high school career. Students are encouraged to share information with parents and to spend time consulting with teachers and the student support team whenever possible about specific classes. The guide helps students make informed choices about their desired courses and academic pathway, as well as prepare for university entrance. Click here to view the <a>Student-Parent Handbook.</a>",
    "title4": "UNIVERSITY ADMISSIONS",
    "sub17": "Graduates from RIS have attended dozens of universities around the world over the last 65 years.<br></br>RIS Ratchapruek focuses on finding the best fit for each child - in terms of country, context, language, and program of study.<br></br>The Student Support, curriculum, and guidance teams work together closely to advise students and families on university entry requirements and planning high school coursework and diploma pathways with the end goal in mind."
  },
  "SchoolWide": {
    "header": "SCHOOLWIDE LEARNER OUTCOME",
    "header1": "Head & knowledge",
    "title1": "Creative",
    "desc1": "They are intrinsically motivated and independent.  When they are interested in a task or creation, they take ownership of their creativity and complete tasks with confidence.  They also think deeply about whatever they are working on and come up with new levels of depth for traditional topics.<br></br><br></br>They are full of creativity and like to do things in their own special way. When they find something they're excited about creating, they take charge of their ideas and finish their projects feeling proud of what they've made. They also think deeply about their creative projects and come up with new and exciting ideas about things that are usually well-known.",
    "title2": "CRITICAL THINKERS",
    "desc2": "They improve the quality of their learning by using acquired knowledge to analyze, assess and reconstruct their ideas.  They question their own processes, are aware of personal strengths and weaknesses, organize their thoughts and evaluate personal success.  They are drivers of their own learning and often push their learning beyond what is presented to them.<br></br><br></br>They improve their learning by using what they've learned to think carefully, figure things out, and put their ideas together in new ways. They ask themselves questions about how they're doing things, know what they're good at and where they might need help, organize their thoughts, and think about how well they're doing. They want to feel like they are in charge of their own learning and they often try to learn even more than what they're taught.",
    "title3": "OPEN-MINDED",
    "desc3": "They understand and appreciate their own cultures and beliefs, and they are open to perspectives, values and traditions of other individuals and communities.  They keep an open mind to understand other points of view, learn from other perspectives, use this knowledge as an opportunity to grow and resolve conflict. <br></br><br></br>They want to know about other people and accept them for who they are and what they believe in. They also like to learn about how other people see things, what they think is important, and how they do things. They're good at listening to different ideas, learning from what other people think, and using this knowledge to become even better. They also use what they learn to help solve problems and disagreements.",
    "header2": "HANDS & SKILLS",
    "title4": "EFFECTIVE COMMUNICATORS",
    "desc4": "They are able to form ideas and information in a clear and logical way.  They can then express these ideas through a variety of ways dependent upon the receiver.  They understand that communication requires both delivering and receiving information.<br></br><br></br>They are good at putting their thoughts and information together in a way that people can understand clearly. They can share their thoughts in different ways, depending on who they're talking to. They know that communication is about not just talking, but also listening and understanding what others say.",
    "title5": "COLLABORATIVE",
    "desc5": "They work alongside others with the goal of learning or creating something new.  They understand that multiple perspectives bring depth to a learning experience and value diverse input.  They understand team processes and see value in collective experiences.  They understand that others have necessary skills for expanding a learning experience.<br></br><br></br>They like to team up with others to learn or make new things together. They know that when a lot of people share their ideas, it makes learning even more interesting. They think it is important to listen to what different people have to say. They also know how teams work and think it's good to do things together. They understand that everyone has something important to add to the learning experience.",
    "title6": "RESOURCEFUL",
    "desc6": "They possess a growth mindset and resiliency that allow them to find and use available resources to solve problems and achieve goals.  They are able to envision the path for achieving goals and identify the necessary steps for achieving them.  They think systematically to assure success regardless of which resources are available.<br></br><br></br>They have a special way of thinking that helps them find and use things around them to fix problems and reach their goals. They can see the way to get things done and know what they need to do step by step. They are good at thinking in an organized way to make sure they succeed, no matter what they have to work with.",
    "title7": "EMBRACE DIVERSITY",
    "desc7": "They understand that each individual is unique and offers their own perspectives.  They go beyond tolerance and shift into celebrating the differences that each member of the community possesses.  They respect these differences and use them to shape their own perspectives.<br></br><br></br>They know that everyone is different and they have their own way of seeing things. They don't just accept these differences – they enjoy them and think they make the group better. They treat these differences with kindness and use them to help them see the world in new ways.",
    "title8": "LEAD HAPPY & HEALTHY LIVES",
    "desc8": "They understand that their own actions impact the quality of their life.  They assess situations to help make the right choices.  They understand how intellectual, emotional and physical well being play a part in creating a balanced lifestyle.<br></br><br></br>They know that what they do affects how good they feel. They look at things carefully to make good decisions. They also know that taking care of their mind, heart, and body helps them live a good and balanced life.",
    "title9": "HELP OTHERS",
    "desc9": "They understand that they are individuals and agents of change within a greater community and work to achieve success for the greater whole.  They know that sometimes they must put others before themselves for the common good.   They seek opportunities to assist and guide others toward success with empathy and kindness.<br></br><br></br>They know they're part of a bigger group and try to make things better for everyone. They understand that sometimes it's important to help others even if it means not thinking only about themselves. They look for chances to help and show others the way to do well.",
    "header3": "HEART & VALUES"
  },
  "Contact": {
    "header": "CONTACT",
    "address": "Address",
    "address-sub1": "Ruamrudee International School Ratchapruek Campus<br></br>999 Moo 4 Bang Kruai-Sai Noi Road, Bang Krang<br></br>Nonthaburi, Nonthaburi 11000 Thailand",
    "address-sub2": "โรงเรียนร่วมฤดีวิเทศศึกษา ราชพฤกษ์ แคมปัส<br></br>999 หมู่ 4 ถนนบางกรวย–ไทรน้อย<br></br>ตำบล บางกร่าง อำเภอ เมืองนนทบุรี จังหวัด นนทบุรี 11000 ",
    "phone": "PHONE",
    "phone-sub": "Telephone: <b>+66 (0)2 030 0533</b>",
    "contact-form": "CONTACT FORM",
    "name": "Name ",
    "email": "Email",
    "telephone": "Telephone",
    "subject": "Subject",
    "comment": "Comment",
    "select1": "General Inquiries",
    "select2": "Admissions",
    "select3": "Employment",
    "select4": "Others",
    "submit": "Submit"
  },
  "Calendar": {
    "header": "School Calendar",
    "": "",
    "": "",
    "": "",
    "": "",
    "": "",
    "": "",
    "": "",
    "": "",
    "": "",
    "": "",
    "": "",
    "": "",
    "": "",
    "": "",
    "": "",
    "": ""
  }
}
