{
  "Navbar": {
    "apply": "Apply Now",
    "book-tour": "Book a Tour",
    "school-map": "School Map",
    "contact-us": "Contact Us",
    "news": "News",
    "school-calendar": "School Calendar",
    "work-risr": "Work at RISR",
    "portals": "Portals"
  },
  "Footer": {
    "school-name": "Ruamrudee International school<br></br>Ratchapruek campus",
    "tel": "+66 (0)2 030 0533",
    "address": "Bang Kruai - Sai Noi Rd, Tambon Bang Krang,<br></br> Amphoe Mueang Nonthaburi, Chang Wat<br></br> Nonthaburi 11000",
    "admissions": "admissions",
    "tuition": "Tuition & Fees",
    "apply": "How to Apply",
    "book": "Book a Tour",
    "scholarships": "Scholarships",
    "about": "About RISR",
    "overview": "Overview",
    "history": "History",
    "vision": "Vision & Mission",
    "curriculum": "Curriculum",
    "facilities": "Facilities",
    "leadership": "Leadership Team",
    "academics": "academics",
    "pre-kindergarten": "Pre-Kindergarten",
    "elementary-school": "Elementary School",
    "middle-school": "Middle School",
    "hight-school": "Hight School",
    "community": "community",
    "ris-minburi": "RIS Minburi Campus",
    "ris-early": "RIS Early Years Campus",
    "ris-phuket": "RIS Phuket Campus",
    "work": "Work at RISR",
    "personal-data-policy": "Personal Data Policy",
    "copyright": " 2024 Ruamrudee International School Ratchapruek campus"
  },
  "School-map": {
    "facilities": "FACILITIES",
    "facilities-details": "RIS Ratchapruek is located in Bang Kruai, Nonthaburi. Our purpose-built campus is located near Ratchapruek Road, about 20 kilometers north of Bangkok and west of the Chao Praya River. Separate buildings for each section, dedicated classrooms, community space, indoor and outdoor playgrounds, a soft-play motor room, and swimming pool for Middle and High School, as well as a swimming pool designed for our youngest learners, students ages 2-5 are given a gentle introduction to school in a warm and caring environment.<br></br><br></br>Our secondary building is currently being constructed. The secondary building will house our middle school and high school programs.",
    "school-map": "SCHOOL MAP"
  },
  "Home": {
    "school-name": "RUAMRUDEE INTERNATIONAL SCHOOL<br></br>RATCHAPRUEK CAMPUS",
    "news": "NEWS",
    "ris-history": "RIS HISTORY",
    "view-all-news": "View all news"
  },
  "Tuition": {
    "title": "TUITION & FEES",
    "click-below": "Click below to view a link or download a PDF:",
    "content": "Tuition & Fees 2022–2023"
  },
  "Scholarship": {
    "title": "SCHOLARSHIPS",
    "scholarship": "SCHOLARSHIP",
    "content": "RISR offers scholarships that support the school's mission while recognizing student achievement — excellence in and out of the classroom and demonstrated leadership. The school awards a variety of scholarships on a competitive basis to incoming and current to exceptional students each year. We also provide need-based financial assistance to qualified families. For more information, please contact the the RISR Admissions Office at:  ",
    "email": "admissions@risr.ac.th"
  },
  "Curriculum": {
    "title": "CURRICULUM",
    "curriculum-content": "RIS follows the American curriculum, which is standards-based. Standards are skills and concept knowledge aligned for the stage of development that corresponds to each grade level.<br></br><br></br>From one grade level to another, students build a progression of standards that deepens their understanding of each content area and enhances their skills. Teachers are highly skilled in using ongoing assessments to understand what concepts and skills students have mastered and what they are ready to learn next. This ensures a rigorous approach for students through differentiation.<br></br><br></br>Standards include the Washington, D.C. Early Childhood Standards and American Education Reaches Out (AERO) standards for our core subject areas of English language, mathematics, and social studies, Next Generation Science Standards (NGSS) for science and ISTE for integrated technology, and standards specific to specialist subjects."
  },
  "Extended": {
    "title": "EXTENDED DAY PROGRAM",
    "edps": "EDPs 2023–2024SESSION 2",
    "ris-extended": "RIS Extended Day Program Policy",
    "sub1": "The Extended Day Program at Ruamrudee International School strives to provide a welcoming, fun, and safe learning environment for students. Courses are designed to challenge, excite, and intrigue children through a variety of different educational fields, including Science, Technology, Mathematics, Sports, and the Arts. Courses are sponsored (taught) by academic professionals from both Ruamrudee International School faculty and outsourced vendors.",
    "sub2": "Each year, we offer three EDP sessions of 8 weeks per session (unless otherwise stated). For the current academic year, RIS has put the following policies into practice to ensure a safe, fair, and well-managed program for our local community."
  },
  "Overview": {
    "title": "OVERVIEW",
    "established": "ESTABLISHED",
    "established-sub": "1957",
    "website": "WEBSITE",
    "website-sub": "WEBSITE",
    "address": "ADDRESS",
    "address-sub": "Ruamrudee International School Ratchapruek Campus<br></br>999 Moo 4 Bang Kruai-Sai Noi Road, Bang Krang<br></br>Nonthaburi, Nonthaburi 11000 Thailand",
    "email": "EMAIL",
    "email-sub1": "<b>info@rism.ac.th</b>",
    "email-sub2": "<b>admissions@rism.ac.th</b>",
    "phone": "PHONE",
    "phone-sub": "+66 (0)2 791 8900",
    "curriculum": "CURRICULUM",
    "curriculum-sub": "RIS offers a modified American curriculum. Pre-K follows a learning and development continuum based on the Reggio Emilia approach to learning. Core subjects from Kindergarten to Middle School are aligned with the American Education Reaches Out (AERO) standards. High school students can choose between the International Baccalaureate (IB) Diploma Program and the Advanced Placement (AP) program.",
    "accreditation": "ACCREDITATION",
    "accreditation-sub": "WASC (Western Association of Schools and Colleges), Thai Ministry of Education",
    "affiliations": "AFFILIATIONS",
    "affiliations-sub": "Redemptorists of Thailand, International Baccalaureate (IB), CollegeBoard (AP), EARCOS (East Asia Regional Council of Overseas Schools), CIS (Council of International Schools), ISAT (International Schools Association of Thailand), ONESQA (Office for National Education Standards and Quality Assessment)",
    "enrollment": "ENROLLMENT",
    "enrollment-sub": "1,100 students",
    "ages": "AGES",
    "ages-sub": "3 (Pre-K 3) to 18 (Grade 12)",
    "ratio-teaching": "RATIO OF TEACHING STAFF TO STUDENTS",
    "ratio-teaching-sub1": "Pre-K – Kindergarten: 18 students / class (1 teacher, instructional aide & nanny)",
    "ratio-teaching-sub2": "Grades 1–5: 22 students / class (1 teacher & instructional aid)",
    "ratio-teaching-sub3": "Grades 6–12: 22 students / class (multiple subject specialist teachers)",
    "fees": "FEES",
    "fees-sub": "400,000 baht per year (Pre-K) to 700,000 baht per year (Grade 12), not including registration, campus development, and other fees. ",
    "other-campuses": "Other campuses",
    "other-campuses-sub": "Ruamrudee International School Early Years Campus (Phraya Suren Road, Ramintra-Kanchanapisek area) and Ruamrudee International School Ratchapruek Campus (Bang Kruai-Sai Noi Road, Bang Krang, Nonthaburi)"
  },
  "Vision": {
    "title": "VISION & MISSON",
    "vision": "VISION",
    "vision-sub": "Ruamrudee International School will be known globally as a hallmark of international education, and physical well-being, while fostering compassion through action and shaping the lives of tomorrow's leaders.",
    "mission": "MISSION",
    "mission-sub": "Ruamrudee International School is a Catholic school that provides an interfaith, inclusive, and academically rigorous education for students to be balanced, successful, and compassionate individuals.",
    "ris-sub": "The school seal portrays a globe with the initials RIS below it. The lines of longitude represent the international nature of the school. The impression of a church with a flag atop its roof signifies the Christian spirit of family love that has always characterized the school community, preparing RIS students to be good and responsible citizens of the world.<br></br><br></br>The school motto is engraved in the RIS Senior pin, which is shaped like a shield and bears the Latin words Ad Astra above the symbol of a cross and five stars. Translated “to the stars,” Ad Astra encourages every student to aim for the best, not only in their education but also in their personal and spiritual growth. <br></br><br></br>The school colors are white and blue with a splash of red. As in the Thai National flag, these colors exemplify loyalty and patriotism with school spirit and moral inspiration.",
    "sub2": "Together with the senior gown, the pin is presented at the traditional Senior Convocation held at the beginning of each academic year, to impress upon each student the responsibilities that come along with the privileges of being a senior.",
    "sub3": "The school’s sports mascot is “The Phoenix,” a symbol of strength and excellence. In Egyptian mythology, the phoenix is a beautiful bird that consumes itself by fire every 500 years to rise anew from its ashes. ",
    "studen-learner": "STUDENT LEARNER OUTCOMES(PRINCIPLES OF PHOENIX)"
  }
}
